{
  "id": "due-diligence-guide-for-first-time-international-teachers",
  "title": "Due diligence guide for first-time international teachers",
  "slug": "due-diligence-guide-for-first-time-international-teachers",
  "excerpt": "Research schools thoroughly and decode contracts carefully before accepting international teaching positions. Your homework determines whether you thrive abroad or become a cautionary tale.",
  "content": "<h1>The Due Diligence Guide for First-Time International Teachers</h1>\n\n<p>You've seen the Instagram posts. Teachers on beaches in Bali, weekend trips to Angkor Wat, sunset dinners overlooking the Bosphorus. The lifestyle looks incredible, and the truth is, it can be. But between dreaming about teaching abroad and actually thriving in an international school lies a gap that catches many first-timers off guard. The teachers who succeed overseas aren't necessarily the most adventurous or the most experienced. They're the ones who did their homework before signing anything.</p>\n\n<p>This guide covers the practical research most aspiring international teachers skip. Not the inspirational \"follow your dreams\" advice, but the actual steps for investigating schools, decoding contracts, and asking the right questions before you commit to moving your life across the world.</p>\n\n<h2>Research the School Before They Research You</h2>\n\n<p>International schools operate with far less oversight than their domestic counterparts. No state education department is checking in. No union rep is available when things go wrong. Some schools are exceptional places to work, while others have earned reputations that would make any experienced international teacher run. The difference between these experiences often comes down to research you do before accepting an offer.</p>\n\n<p>Start with International Schools Review, a subscription site where teachers post candid, anonymous reviews of schools worldwide [1]. The $29 membership fee is one of the best investments you can make. Reviews cover everything from administrative competence to housing quality to whether the school actually pays on time. Reading five or six reviews of a school you're considering will tell you more than any polished recruitment video. Pay particular attention to patterns. One negative review might reflect a personality conflict, but five teachers mentioning the same problem suggests something systemic.</p>\n\n<p>Beyond reviews, check the school's accreditation status. Schools affiliated with organizations like the Council of International Schools (CIS), Western Association of Schools and Colleges (WASC), or regional bodies like COBIS and FOBISIA undergo external inspections and must meet specific standards [2]. Accreditation doesn't guarantee a good experience, but it provides a baseline of institutional accountability that unaccredited schools lack entirely.</p>\n\n<p>The most valuable research comes from talking to actual humans. Ask the school to connect you with current teachers, and if they hesitate or refuse, treat that as a significant warning sign. Reputable schools have nothing to hide and often welcome these conversations [2]. When you do connect with teachers, ask specific questions: How responsive is admin when problems arise? Does the school deliver on contract promises? What surprised you most about working here? Listen carefully to what they don't say as much as what they do.</p>\n\n<h2>Decoding Your Contract</h2>\n\n<p>In your home country, employment contracts are backed by labor law, union agreements, and legal recourse if something goes wrong. International contracts exist in a different universe. Your contract is often the only protection you have, which means understanding every clause before signing is not optional.</p>\n\n<p>The most common contract trap involves verbal promises that never make it to paper. A recruiter might promise a two-bedroom apartment during your interview, but if your contract says \"housing provided\" without specifying details, you could arrive to find yourself sharing a room with another teacher [3]. Everything you were promised during interviews must appear in writing. If a school balks at putting something in the contract, assume you won't receive it.</p>\n\n<p>Salary terms require particular scrutiny. Look for a clear breakdown of your compensation, including base salary, housing allowance or provision, flight allowances, and any other benefits. Vague language like \"competitive salary\" or \"housing to be discussed\" should prompt immediate clarification [3]. Understand whether you're paid in local currency or a stable currency like USD, and research what that salary actually means given local cost of living. A number that sounds impressive might stretch thin in Singapore while going far in Vietnam.</p>\n\n<p>Watch for excessive exit penalties. A reasonable contract might include a 30-day notice period and modest penalty for leaving early. Schools that threaten to confiscate your passport, blacklist you from the profession, or demand months of salary for early termination are signaling how they treat employees when conflicts arise [4]. Non-compete clauses that prevent you from working in the same country for years after leaving are another red flag, particularly if you're hoping to build a life in a specific region.</p>\n\n<h2>Questions That Reveal What Job Postings Hide</h2>\n\n<p>Job postings are marketing documents. They showcase the best aspects of a position while glossing over the challenges every job contains. The questions you ask during interviews reveal what postings deliberately omit.</p>\n\n<p>Ask about staff turnover directly. Schools won't always give you exact numbers, but their reaction tells you something. A confident answer about retention suggests stability, while deflection or vague responses about \"the international teaching lifestyle\" may indicate a revolving door [2]. You can often find principal turnover information through web searches. A school that has churned through three heads in five years has deeper problems than any contract can address.</p>\n\n<p>Request specifics about workload. International schools sometimes expect teachers to manage extracurricular activities, weekend events, parent communication, and duties that would fall to specialized staff in larger domestic systems. Asking \"What does a typical week look like outside of classroom hours?\" surfaces expectations that job postings rarely mention. Get this in writing if specific limitations matter to you.</p>\n\n<p>Visa sponsorship deserves explicit attention. Reputable schools arrange work visas before you arrive. If a school suggests you enter on a tourist visa and \"sort out the paperwork later,\" you're being asked to work illegally, which puts you at risk of deportation and leaves you with zero legal protection if the school doesn't deliver on promises [2]. Ask when your work visa will be processed, what documentation you need to provide, and whether the school covers visa costs.</p>\n\n<h2>Where to Start Your Search</h2>\n\n<p>The international teaching job market operates through several main channels, and understanding how they work helps you search strategically.</p>\n\n<p>Search Associates maintains the largest database of international schools, with nearly 1,000 member schools compared to around 400 for ISS [5]. Their job fairs, both virtual and in-person, connect teachers directly with hiring administrators. The registration fee is higher than competitors, but the breadth of their network justifies the cost for many teachers, particularly those targeting top-tier schools in competitive markets.</p>\n\n<p>ISS (International School Services) merged with Schrole and offers a more affordable entry point at around $75 for premium registration [5]. They're particularly strong for teachers seeking positions at American-curriculum schools in Asia and the Middle East. Their virtual iFair events allow face-to-face interviews without travel costs, a significant advantage for teachers who can't attend in-person fairs.</p>\n\n<p>Beyond the major agencies, TES and direct applications remain viable paths. Many schools post openings on their own websites, and a well-crafted direct application can stand out from the agency pile. The trade-off is that agency-affiliated schools have agreed to certain recruitment standards, while schools hiring independently may not.</p>\n\n<h2>The Real Timeline</h2>\n\n<p>First-time international teachers often underestimate how long the process takes. If you're targeting a position starting in August, begin your serious search the previous fall. Top-tier schools often fill positions by January, and waiting until spring limits you to whatever remains.</p>\n\n<p>Document gathering takes longer than expected. Background checks, credential authentication, apostilles, and medical clearances each involve their own timelines. Some countries require documents authenticated through specific processes that take weeks or months. Starting early gives you buffer room when bureaucracy inevitably stalls.</p>\n\n<p>The teachers who land good positions treat the search like a second job for several months. They research extensively, apply strategically, prepare thoroughly for interviews, and negotiate thoughtfully when offers arrive. The teachers who rush in and accept the first thing that looks good often write the cautionary reviews that careful researchers read before making better choices.</p>\n\n<p>Your first international position sets the trajectory for your career abroad. A good experience opens doors to better schools and more desirable locations. A bad experience can make you swear off the whole enterprise before discovering what international teaching actually offers when it works. The difference usually isn't luck. It's homework.</p>\n\n<h2>References</h2>\n\n<p>[1] <a href=\"https://www.internationalschoolsreview.com\" target=\"_blank\" rel=\"noopener noreferrer\">International Schools Review</a> - Teacher reviews and school information</p>\n\n<p>[2] <a href=\"https://internationalteachingfamilies.com/2025/03/28/international-teaching-jobs-red-flags-contracts/\" target=\"_blank\" rel=\"noopener noreferrer\">International Teaching Jobs: Red Flags in Contracts</a> - International Teaching Families</p>\n\n<p>[3] <a href=\"https://internationalteachingfamilies.com/2025/06/16/international-school-contracts/\" target=\"_blank\" rel=\"noopener noreferrer\">International School Contracts: What You Need to Know</a> - International Teaching Families</p>\n\n<p>[4] <a href=\"https://eslauthority.com/teach/china/contract-red-flags/\" target=\"_blank\" rel=\"noopener noreferrer\">Signing a Teaching Contract: Red Flags to Know</a> - ESL Authority</p>\n\n<p>[5] <a href=\"https://worldclasseducators.com/2025/10/27/search-associates-vs-iss-which-international-school-recruitment-agency-is-right-for-you/\" target=\"_blank\" rel=\"noopener noreferrer\">Search Associates vs ISS: Which Recruitment Agency Is Right for You?</a> - World Class Educators</p>\n\n\n\n<hr>\n\n<strong>About This Article</strong>\n\n<p>Written by School Transparency, with AI assistance (Claude Sonnet 4.5). Research data sourced from World Bank API, International Schools Review, Reddit education communities, and Numbeo cost of living data.</p>\n\n<strong>Tech Stack:</strong> n8n workflow automation, Google Sheets data management, Anthropic's APIs for content generation, custom web scrapers for real-time data collection.\n\n<em>School Transparency is committed to data-driven insights for international teachers. All articles combine human expertise with AI tools to provide comprehensive, current information.</em>\n\n<hr>\n",
  "category": "Job Search & Hiring",
  "subcategory": "Interview Preparation",
  "publishedDate": "2026-02-06",
  "author": "School Transparency",
  "featuredImage": "https://images.unsplash.com/photo-1544776193-352d25ca82cd?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4NDM5OTl8MHwxfHNlYXJjaHwxfHxlZHVjYXRpb24lMjBEdWUlMjBkaWxpZ2VuY2UlMjBndWlkZSUyMGZpcnN0fGVufDB8fHx8MTc3MDM1MTY5Nnww&ixlib=rb-4.1.0&q=80&w=1080",
  "sources": [
    {
      "title": "International Schools Review",
      "url": "https://www.internationalschoolsreview.com"
    },
    {
      "title": "International Teaching Jobs: Red Flags in Contracts",
      "url": "https://internationalteachingfamilies.com/2025/03/28/international-teaching-jobs-red-flags-contracts/"
    },
    {
      "title": "International School Contracts: What You Need to Know",
      "url": "https://internationalteachingfamilies.com/2025/06/16/international-school-contracts/"
    },
    {
      "title": "Signing a Teaching Contract: Red Flags to Know",
      "url": "https://eslauthority.com/teach/china/contract-red-flags/"
    },
    {
      "title": "Search Associates vs ISS: Which Recruitment Agency Is Right for You?",
      "url": "https://worldclasseducators.com/2025/10/27/search-associates-vs-iss-which-international-school-recruitment-agency-is-right-for-you/"
    }
  ],
  "relatedArticles": [
    "what-questions-should-i-ask-about-workplace-culture-at-ib-schools-in-asia",
    "should-experienced-ib-teachers-use-recruiters-or-apply-directly-to-schools-in-dubai"
  ]
}