{
  "id": "finland-went-all-in-on-classroom-screens-now-it-s-going-back-to-books",
  "title": "Finland Went All-In on Classroom Screens. Now It's Going Back to Books.",
  "slug": "finland-went-all-in-on-classroom-screens-now-it-s-going-back-to-books",
  "excerpt": "Finland banned classroom smartphones and reversed its digital-first policy after teachers reported worse concentration and test scores declined. Towns that went back to physical textbooks saw students regain focus and sleep better.",
  "content": "<h1>Finland Went All-In on Classroom Screens. Now It's Going Back to Books.</h1>\n\n\n<p>For about fifteen years, Finland was the country every education conference wouldn't shut up about. The PISA scores, the teacher autonomy, the lack of standardized testing. If you've taught internationally for any length of time, you've sat through at least one PD session where someone held Finland up as the gold standard. I certainly have, at schools in both Vietnam and South Korea.</p>\n\n\n<p>So when Finland started pushing screens into every classroom, handing laptops to 11-year-olds and phasing out physical textbooks, a lot of schools around the world followed. The logic seemed solid: if Finland does it, it must work. Turns out, Finland isn't so sure anymore.</p>\n\n\n<h2>What Finland Actually Did</h2>\n\n\n<h3>The Smartphone Ban</h3>\n\n\n<p>In August 2025, Finland passed legislation banning personal smartphones from all classroom instruction in grades 1 through 9 [1]. The law doesn't confiscate phones at the school gate; students can still carry them. But during lessons, phones stay away unless a teacher gives explicit permission for a specific learning activity. Teachers and principals now have legal authority to confiscate devices that disrupt learning [2].</p>\n\n\n<p>This wasn't a fringe idea pushed by a few concerned parents. A poll by the Trade Union of Education in Finland found that 70% of teachers believed digital gadgets had impaired their students' ability to concentrate [3]. Seven out of ten. That's not a debate. That's a consensus.</p>\n\n\n<h3>Riihimaki's Paper Rebellion</h3>\n\n\n<p>The smartphone ban tells one story. But what happened in Riihimaki, a small town of about 30,000 people north of Helsinki, tells a more interesting story. In 2018, Riihimaki's middle schools stopped using most physical textbooks entirely [4]. Students got laptops. Lessons went digital. It was exactly the kind of move that gets praised in education technology circles.</p>\n\n\n<p>By 2024, they reversed course. Backpacks full of books again. Pens and paper on desks instead of screens.</p>\n\n\n<p>Why? The results had gotten worse. Not catastrophically, not overnight, but steadily, in ways that teachers could see long before the data confirmed it. Fourteen-year-old students in the town told reporters their concentration improved after books came back [4]. One student said reading from a book was faster and that not staring at a screen before bed made it easier to fall asleep. These aren't revolutionary observations. They're the kind of thing teachers have been saying for years, only to be told they were resistant to change.</p>\n\n\n<h2>The Numbers Behind the Reversal</h2>\n\n\n<p>Finland's PISA scores have been declining since 2012, and the 2022 results were the worst yet [5]. Across math, reading, and science, Finnish students dropped more than 20 points on average from their 2012 performance. They still score above the OECD average, but the trend line is impossible to ignore. Finland went from being the undisputed top performer to being, well, just good.</p>\n\n\n<p>The data on device distraction is particularly striking. According to the 2022 PISA results, 41% of Finnish students reported that digital device use disrupted their concentration during math class [5]. The OECD average is 30%. So Finnish kids, in the country that was supposed to show the world how to do education right, were getting distracted by their devices at higher rates than most of the developed world.</p>\n\n\n<p>Nobody's arguing that screens caused all of Finland's decline. Increasing socioeconomic inequality, shifting reading habits among young people, and reduced education funding all played roles [6]. But the screens weren't helping, and Finnish policymakers decided to stop pretending they were.</p>\n\n\n<h2>This Isn't Just Finland</h2>\n\n\n<p>Finland tends to get the headlines, but this is a global pattern now. By the end of 2024, 40% of the world's education systems (79 countries) had implemented some form of school phone restriction [7]. UNESCO came out explicitly recommending that smartphones only be permitted in schools when they clearly support learning [8].</p>\n\n\n<p>And there's data to support the shift. A widely cited UK study found that banning phones in schools was associated with a 6.4% increase in national exam scores, with the biggest improvements among students who were already struggling [7]. That's not a marginal gain. For a low-performing student, that's the difference between passing and failing a subject.</p>\n\n\n<table><thead><tr><th>Country</th><th>Policy</th><th>Year Implemented</th></tr></thead><tbody><tr><td>France</td><td>Phones banned in schools for under-15s</td><td>2018</td></tr><tr><td>Netherlands</td><td>Classroom phone ban (voluntary, widely adopted)</td><td>2024</td></tr><tr><td>Finland</td><td>Phones banned during lessons, grades 1-9</td><td>2025</td></tr><tr><td>Australia</td><td>Multiple states banning phones in schools</td><td>2024-2025</td></tr><tr><td>Italy</td><td>Phones banned during lessons</td><td>2022</td></tr></tbody></table>\n\n\n<p>The pattern is clear. Countries that rushed to digitize classrooms are now setting guardrails, or pulling back entirely.</p>\n\n\n<h2>What This Means If You Teach Internationally</h2>\n\n\n<p>If you're at an international school right now, you've probably noticed your school either already has a phone policy or is actively debating one. And if you're job hunting, a school's technology policy tells you something real about how they think about teaching. Here's what I'd pay attention to.</p>\n\n\n<h3>Watch for Schools That Lead With Hardware</h3>\n\n\n<p>There's nothing wrong with giving every student a laptop. There is something wrong with giving every student a laptop because \"we're a 21st-century school\" and leaving teachers to figure out how to make it work. If a school's tech strategy starts with the hardware and works backward to the pedagogy, that's a yellow flag. Finland tried this approach nationally. It didn't go well.</p>\n\n\n<h3>Try It in Your Own Classroom</h3>\n\n\n<p>You don't need to wait for your school to set a policy. I've taught in schools with no phone rules at all, and I've taught in schools where phones go in a pouch at the door. In both situations, the teacher sets the tone.</p>\n\n\n<p>I started doing this with my Grade 10 English class a few years back: closing all devices for the first fifteen minutes of every lesson. It took about two weeks for students to stop looking anxious without their screens. After that, the quality of class discussion got noticeably better. Not because screens are evil, but because we'd removed the easiest escape route from boredom. And boredom is actually where a lot of good thinking starts.</p>\n\n\n<h3>The Distinction That Matters</h3>\n\n\n<p>Finland isn't saying technology in classrooms is bad. The Finnish National Agency for Education has been clear: digital tools that support learning are fine [9]. The problem is personal devices used for entertainment and social media during school hours. That distinction matters a lot. A well-designed lesson using a shared class screen for data analysis is completely different from 25 students with their own phones under their desks.</p>\n\n\n<p>The research backs this up. Moderate, teacher-directed use of technology improves outcomes. Unrestricted personal device use makes them worse [5]. The question was never \"screens or no screens.\" It was always \"who controls the screen, and for what purpose?\"</p>\n\n\n<h2>Conclusion</h2>\n\n\n<p>Finland will be the test case over the next few years; if PISA scores stabilize after the ban, expect more countries to follow. But you don't need to wait for national policy to catch up with what you're already seeing. Trust your classroom instincts on this one, because sometimes the old ways work precisely because they actually work.</p>\n\n\n<h2>References</h2>\n\n\n<p>[1] <a href=\"https://www.euronews.com/my-europe/2025/05/01/finland-to-restrict-the-use-of-smartphones-in-school-during-the-day\" target=\"_blank\" rel=\"noopener noreferrer\">Finland to restrict the use of smartphones during the school day</a> - Euronews</p>\n\n\n<p>[2] <a href=\"https://valtioneuvosto.fi/en/-/1410845/restrictions-to-be-placed-on-the-use-of-phones-and-mobile-devices-in-schools\" target=\"_blank\" rel=\"noopener noreferrer\">Restrictions to be placed on the use of phones and mobile devices in schools</a> - Finnish Government</p>\n\n\n<p>[3] <a href=\"https://english.news.cn/20250807/50b49a7f79d9408aa047ace897421c56/c.html\" target=\"_blank\" rel=\"noopener noreferrer\">Controversial mobile phone ban kicks in for Finnish students</a> - Xinhua</p>\n\n\n<p>[4] <a href=\"https://learningenglish.voanews.com/a/finnish-students-go-back-to-school-with-books-not-screens/7780131.html\" target=\"_blank\" rel=\"noopener noreferrer\">Finnish Students Go Back to School with Books, Not Screens</a> - VOA News</p>\n\n\n<p>[5] <a href=\"https://valtioneuvosto.fi/en/-/1410845/pisa-2022-performance-fell-both-in-finland-and-in-nearly-all-other-oecd-countries\" target=\"_blank\" rel=\"noopener noreferrer\">PISA 2022: Performance fell both in Finland and in nearly all other OECD countries</a> - Finnish Government</p>\n\n\n<p>[6] <a href=\"https://www.oph.fi/en/blog/pisa-results-reflect-broader-changes-finnish-society\" target=\"_blank\" rel=\"noopener noreferrer\">PISA results reflect broader changes in Finnish society</a> - Finnish National Agency for Education</p>\n\n\n<p>[7] <a href=\"https://internationalschools.britishcouncil.org/blog/mobile-phones-in-schools-latest-policies-and-research-from-around-the-world\" target=\"_blank\" rel=\"noopener noreferrer\">Mobile phones in schools: policies and research from around the world</a> - British Council</p>\n\n\n<p>[8] <a href=\"https://www.unesco.org/en/articles/smartphones-school-only-when-they-clearly-support-learning\" target=\"_blank\" rel=\"noopener noreferrer\">Smartphones in school: only when they clearly support learning</a> - UNESCO</p>\n\n\n<p>[9] <a href=\"https://www.oph.fi/en/news/2024/finnish-national-agency-education-recommends-limiting-mobile-phone-use-schools-and\" target=\"_blank\" rel=\"noopener noreferrer\">Finnish National Agency for Education recommends limiting mobile phone use</a> - Finnish National Agency for Education</p>\n\n<hr>\n\n<strong>About This Article</strong>\n\n<p>Written by School Transparency, with AI assistance (Claude Sonnet 4.5). Research data sourced from World Bank API, International Schools Review, Reddit education communities, and Numbeo cost of living data.</p>\n\n<strong>Tech Stack:</strong> n8n workflow automation, Google Sheets data management, Anthropic's APIs for content generation, custom web scrapers for real-time data collection.\n\n<em>School Transparency is committed to data-driven insights for international teachers. All articles combine human expertise with AI tools to provide comprehensive, current information.</em>\n\n<hr>\n",
  "category": "Professional Development",
  "subcategory": "Teaching Methods",
  "publishedDate": "2026-02-21",
  "author": "School Transparency",
  "featuredImage": "https://images.unsplash.com/photo-1695514811061-7895bd5411e0?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4NDM5OTl8MHwxfHNlYXJjaHwxfHxGaW5sYW5kJTIwV2VudCUyMEFsbCUyMENsYXNzcm9vbXxlbnwwfHx8fDE3NzE2NTQ4MjJ8MA&ixlib=rb-4.1.0&q=80&w=1080",
  "imageCredit": "Photo by <a href=\"https://unsplash.com/@eiskonen?utm_source=school_transparency&utm_medium=referral\">Hans Eiskonen</a> on <a href=\"https://unsplash.com?utm_source=school_transparency&utm_medium=referral\">Unsplash</a>",
  "sources": [
    {
      "title": "Finland to restrict the use of smartphones during the school day",
      "url": "https://www.euronews.com/my-europe/2025/05/01/finland-to-restrict-the-use-of-smartphones-in-school-during-the-day"
    },
    {
      "title": "Restrictions to be placed on the use of phones and mobile devices in schools",
      "url": "https://valtioneuvosto.fi/en/-/1410845/restrictions-to-be-placed-on-the-use-of-phones-and-mobile-devices-in-schools"
    },
    {
      "title": "Controversial mobile phone ban kicks in for Finnish students",
      "url": "https://english.news.cn/20250807/50b49a7f79d9408aa047ace897421c56/c.html"
    },
    {
      "title": "Finnish Students Go Back to School with Books, Not Screens",
      "url": "https://learningenglish.voanews.com/a/finnish-students-go-back-to-school-with-books-not-screens/7780131.html"
    },
    {
      "title": "PISA 2022: Performance fell both in Finland and in nearly all other OECD countries",
      "url": "https://valtioneuvosto.fi/en/-/1410845/pisa-2022-performance-fell-both-in-finland-and-in-nearly-all-other-oecd-countries"
    },
    {
      "title": "PISA results reflect broader changes in Finnish society",
      "url": "https://www.oph.fi/en/blog/pisa-results-reflect-broader-changes-finnish-society"
    }
  ],
  "relatedArticles": [
    "how-will-new-ib-curriculum-updates-affect-teacher-workload-in-international-schools",
    "overcoming-classroom-management-language-barriers-for-native-english-teachers-in-china",
    "should-new-international-teachers-join-local-teaching-associations-or-global-expat-groups"
  ]
}