{
  "id": "how-to-write-an-international-teaching-cv-that-actually-gets-callbacks",
  "title": "How to write an international teaching CV that actually gets callbacks",
  "slug": "how-to-write-an-international-teaching-cv-that-actually-gets-callbacks",
  "excerpt": "International school CVs need 2-3 pages, a professional photo, and personal details like age and dependents that affect your visa and housing package. Your domestic resume won't work because schools outside your home country expect different formats and information.",
  "content": "<h1>How to Write an International Teaching CV That Actually Gets Callbacks</h1>\n\n\n<p>Your CV is the first thing a hiring committee sees, and in international school recruitment, it works differently than what you're used to back home. A domestic teaching resume that landed you interviews in Texas or London might get passed over entirely by a school in Bangkok or Bogota. The expectations are different, the format is different, and the details that matter are ones most first-time applicants don't even think to include.</p>\n\n\n<p>I've reviewed hundreds of teaching CVs over the years, both as a department head and while sitting on hiring panels. The ones that get callbacks share certain patterns, and the ones that get ignored share different ones. Here's what actually separates the two.</p>\n\n\n<h2>The Format International Schools Expect</h2>\n\n\n<p>The first thing to understand is that international schools expect a CV, not a one-page American-style resume. According to Edvectus, a major international recruitment firm, teachers with one to three years of experience should have a two-page CV, those with four to ten years can go up to three pages, and nobody should ever exceed five pages [1]. Teacher Horizons is even more direct: keep it to two pages maximum unless you're applying for senior leadership, where three is acceptable [2].</p>\n\n\n<p>Beyond length, there's a formatting detail that surprises many Western applicants. When applying to schools in the Middle East and Asia, you're expected to include a professional photograph at the top of your CV [1]. Not a passport photo, not a selfie cropped from a group shot. A professional, friendly headshot. Schools in Europe and the Americas are less consistent about this, but if you're applying broadly, just include one. Teacher Horizons recommends placing it in the top right corner and keeping it small [2].</p>\n\n\n<p>Save the final version as a PDF. Google Docs and Word files render differently on different computers, and you don't want your carefully formatted CV arriving as a garbled mess on a principal's laptop in Kuala Lumpur [2].</p>\n\n\n<h2>What Goes at the Top (And Why It's Different)</h2>\n\n\n<p>International school CVs require personal details that would be unusual or even illegal to request in countries like the US or UK. Include your date of birth, nationality, marital status, and number of dependents [1]. This isn't about discrimination; it's practical. Schools need to know your age because some countries have visa restrictions based on it. They need to know about dependents because it affects housing allocation, flight allowances, and tuition benefits. A school budgeting for a single teacher's apartment and one return flight is looking at a very different cost than a family of four.</p>\n\n\n<p>After your contact details and personal information, add a short profile statement. Three to four sentences maximum [1] [2]. This isn't a teaching philosophy essay. It's a quick pitch: your qualifications, years of experience, the curricula you've taught (IB, AP, British, American), and one line about what you bring beyond the classroom. First person is fine here.</p>\n\n\n<p>A strong profile statement might read something like: \"I'm a secondary science teacher with eight years of experience across IB and British curricula in Southeast Asia. I've led the MYP Sciences department at my current school for three years and coached the varsity basketball program. I'm looking for a collaborative school where I can contribute to both academic and extracurricular life.\"</p>\n\n\n<p>A weak one reads like a motivational poster: \"I am a passionate and dedicated educator committed to inspiring the next generation of learners.\" Hiring committees read dozens of those every week. They skip them.</p>\n\n\n<h2>The Experience Section: What Hiring Committees Actually Scan For</h2>\n\n\n<p>This is where most CVs either win or lose. List your positions in reverse chronological order with specific start and end dates (month and year, not just year). Gaps get noticed, and unexplained gaps get assumptions [1].</p>\n\n\n<p>For each role, include the school name, city, country, and the curricula offered. Then list the specific subjects and grade levels you taught. If you taught IB Biology at the Higher Level, say that. If you taught AP US History, say that. Hiring committees are matching your experience against their open position; the more specific you are, the easier you make their decision.</p>\n\n\n<p>Here's what to include for each position:</p>\n\n\n<table><thead><tr><th>Include</th><th>Why It Matters</th></tr></thead><tbody><tr><td>Curricula taught (IB, AP, British, etc.)</td><td>Schools want curriculum-specific experience</td></tr><tr><td>Exact subjects and grade levels</td><td>They're matching you to a specific opening</td></tr><tr><td>Percentage of ELL students in your classes</td><td>Shows you can handle multilingual classrooms</td></tr><tr><td>Exam results or student outcomes</td><td>Concrete evidence of teaching effectiveness</td></tr><tr><td>Leadership roles held</td><td>Department head, curriculum coordinator, etc.</td></tr><tr><td>Extracurricular contributions</td><td>Coaching, clubs, trips; schools value this highly</td></tr></tbody></table>\n\n\n<p>Schrole specifically recommends quantifying your achievements where possible [3]. Instead of \"improved student engagement,\" write something like \"redesigned the Grade 10 assessment structure, which correlated with a 15-point increase in average IB scores over two years.\" But only include numbers you can actually back up. If someone asks you about that claim in an interview, you need to be able to talk about it in detail.</p>\n\n\n<p>Limit yourself to three to five bullet points per role. Edvectus notes that more than that and hiring committees stop reading [1]. Allocate more space to your recent and relevant positions; that teaching assistant role from 2012 can be a single line.</p>\n\n\n<h2>What Most People Get Wrong</h2>\n\n\n<p>I've seen the same mistakes kill otherwise strong applications over and over. The biggest one is unexplained acronyms. You know what PYP stands for. The HR coordinator doing the first screening might not. Edvectus is explicit about this: define every acronym on first use [1]. Write \"Primary Years Programme (PYP)\" the first time, then use the acronym after that. Same goes for IGCSE, MAP, CASEL, or whatever framework-specific terminology you're used to.</p>\n\n\n<p>The second killer is generic language. \"Responsible for teaching English to middle school students\" is a job description, not an achievement. Rewrite it as what you actually accomplished in that role. \"Developed a literature unit incorporating local Taiwanese authors that was adopted across the department\" tells a hiring committee something real about what you'd bring to their school.</p>\n\n\n<p>And here's one that catches a lot of North American teachers off guard: don't leave out your extracurricular involvement. In domestic schools, coaching and clubs are often separate from your teaching identity. In international schools, they're part of the package. Schools want teachers who run after-school activities, coach sports, lead Model UN, or organize field trips. If you've done any of that, give it proper space on your CV. Schrole calls this out specifically as something that helps candidates stand out [3].</p>\n\n\n<h2>References: The Details That Signal Professionalism</h2>\n\n\n<p>Teacher Horizons makes a strong point about references that most guides skip: your referees should be at the Deputy Head level or above, and they should be using professional email addresses [2]. A reference from \"jane_smith_1987@gmail.com\" doesn't carry the same weight as one from \"j.smith@schoolname.edu.\" If your former supervisor has left their school and only has a personal email, that's understandable, but note their former title and institution clearly.</p>\n\n\n<p>List two to three references. Make sure at least one is a current or recent direct supervisor. And always, always tell your referees before listing them. Nothing derails an application faster than a surprised reference who gives a lukewarm response because they weren't expecting the call.</p>\n\n\n<h2>One Last Thing</h2>\n\n\n<p>Before you submit, have someone else proofread your CV. Not just for typos (though those matter; Search Associates warns that formatting errors and spelling mistakes will get you passed over immediately), but for clarity [4]. Can someone outside education understand what you did? Does the document tell a coherent story about your career so far? If a principal in Santiago can read your CV and picture you in their school within 30 seconds, you've done it right.</p>\n\n\n<h2>References</h2>\n\n\n<p>[1] <a href=\"https://www.edvectus.com/pages/cv-and-resume-tips-for-international-teachers\" target=\"_blank\" rel=\"noopener noreferrer\">CV and Resume Tips for International Teachers (Edvectus)</a></p>\n\n\n<p>[2] <a href=\"https://www.teacherhorizons.com/advice/how-to-write-a-cv-for-international-teaching-job\" target=\"_blank\" rel=\"noopener noreferrer\">How to Write a Great CV for International Teaching (Teacher Horizons)</a></p>\n\n\n<p>[3] <a href=\"https://www.schrole.com/news/top-tips-creating-an-international-teacher-cv-that-stands-out/\" target=\"_blank\" rel=\"noopener noreferrer\">Top Tips: Creating an International Teacher CV That Stands Out (Schrole)</a></p>\n\n\n<p>[4] <a href=\"https://anz.searchassociates.com/international-school-application/\" target=\"_blank\" rel=\"noopener noreferrer\">Tips for Your International School Application (Search Associates)</a></p>\n\n<hr>\n\n<strong>About This Article</strong>\n\n<p>Written by School Transparency, with AI assistance (Claude Sonnet 4.5). Research data sourced from World Bank API, International Schools Review, Reddit education communities, and Numbeo cost of living data.</p>\n\n<strong>Tech Stack:</strong> n8n workflow automation, Google Sheets data management, Anthropic's APIs for content generation, custom web scrapers for real-time data collection.\n\n<em>School Transparency is committed to data-driven insights for international teachers. All articles combine human expertise with AI tools to provide comprehensive, current information.</em>\n\n<hr>\n",
  "category": "Teacher Career",
  "subcategory": "Resume & Applications",
  "publishedDate": "2026-02-14",
  "author": "School Transparency",
  "featuredImage": "https://images.unsplash.com/photo-1601742638130-f76cbe00ad01?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4NDM5OTl8MHwxfHNlYXJjaHwxfHx3cml0ZSUyMGludGVybmF0aW9uYWwlMjB0ZWFjaGluZyUyMGFjdHVhbGx5fGVufDB8fHx8MTc3MTA0NTYyN3ww&ixlib=rb-4.1.0&q=80&w=1080",
  "imageCredit": "Photo by <a href=\"https://unsplash.com/@metelevan?utm_source=school_transparency&utm_medium=referral\">Andrey Metelev</a> on <a href=\"https://unsplash.com?utm_source=school_transparency&utm_medium=referral\">Unsplash</a>",
  "sources": [
    {
      "title": "CV and Resume Tips for International Teachers (Edvectus)",
      "url": "https://www.edvectus.com/pages/cv-and-resume-tips-for-international-teachers"
    },
    {
      "title": "How to Write a Great CV for International Teaching (Teacher Horizons)",
      "url": "https://www.teacherhorizons.com/advice/how-to-write-a-cv-for-international-teaching-job"
    },
    {
      "title": "Top Tips: Creating an International Teacher CV That Stands Out (Schrole)",
      "url": "https://www.schrole.com/news/top-tips-creating-an-international-teacher-cv-that-stands-out/"
    },
    {
      "title": "Tips for Your International School Application (Search Associates)",
      "url": "https://anz.searchassociates.com/international-school-application/"
    }
  ],
  "relatedArticles": [
    "should-i-choose-high-paying-schools-in-uae-or-work-life-balance-schools-in-vietnam",
    "how-does-teaching-experience-in-china-count-toward-canadian-immigration-points-system"
  ]
}