{
  "id": "how-to-get-hired-at-an-international-school",
  "title": "How to get hired at an international school",
  "slug": "how-to-get-hired-at-an-international-school",
  "excerpt": "Landing a job at an international school requires specialized recruitment platforms like Search Associates and ISS, not Indeed. Register on multiple sites and understand the tier system before you apply.",
  "content": "<h1>How to Get Hired at an International School: From Recruitment Platforms to Signed Contracts</h1>\n\n\n<p>Getting hired at an international school isn't like applying for a teaching job back home. The process has its own rhythm, its own gatekeepers, and its own set of unwritten rules that trip up first-timers every single year. I've watched teachers with stellar resumes miss out on great positions because they didn't understand how the system works, and I've seen less experienced candidates land at top-tier schools simply because they played the recruitment game smartly.</p>\n\n\n<p>This article walks through the hiring pipeline from start to finish: where to find openings, how to evaluate schools before they evaluate you, and what to watch for before you sign anything. We also covered this topic in depth on <a href=\"https://www.youtube.com/watch?v=NHUv7dM1cEw\" target=\"_blank\" rel=\"noopener noreferrer\">The EdTech Nomad YouTube channel</a>; consider this the written companion with the tables, links, and specific details you can bookmark for later.</p>\n\n\n<h2>Where the Jobs Actually Are</h2>\n\n\n<p>Most international teaching positions don't show up on Indeed or LinkedIn. The industry runs on specialized recruitment platforms, each with its own network of schools and its own fee structure. Picking the right platforms matters because different agencies serve different school tiers. You don't want to waste a $250 registration fee on a platform that doesn't list schools in your target market.</p>\n\n\n<table><thead><tr><th>Platform</th><th>Cost</th><th>Schools</th><th>Best For</th></tr></thead><tbody><tr><td>Search Associates [1]</td><td>~$250/year</td><td>800+ in 125 countries</td><td>Tier 1 and top Tier 2 schools</td></tr><tr><td>ISS EDUrecruit [2]</td><td>~$200/year</td><td>1,200+ schools</td><td>Broad range, strong in Americas</td></tr><tr><td>Schrole [3]</td><td>~$50/year</td><td>500+ schools</td><td>Budget-friendly, wide coverage</td></tr><tr><td>Teacher Horizons [4]</td><td>Free for teachers</td><td>3,000+ schools</td><td>Mid-tier schools, good for first-timers</td></tr><tr><td>TIE Online [5]</td><td>~$45-49/year</td><td>200+ active postings</td><td>All tiers, nonprofit</td></tr></tbody></table>\n\n\n<p>Search Associates and ISS are the heavy hitters. If you're targeting top-tier international schools (think Singapore American School, American School of Paris, or NIST Bangkok), you'll almost certainly need a profile on one of these. Search Associates runs around 13 recruitment fairs annually, and their placement rate at major events hovers around 70% [1]. That's not a guarantee, but those are strong odds if you've done your prep work.</p>\n\n\n<p>But here's what most guides won't tell you: don't put all your eggs in one basket. Schrole at $50 a year gives you access to roughly 5,000 seasonal vacancies [3]. Teacher Horizons costs nothing and lists over 3,000 schools [4]. Register on two or three platforms, not just one. And supplement your agency searches with LinkedIn (yes, really), International Schools Review for insider intel [6], and the Facebook groups where international teachers actually talk shop.</p>\n\n\n<h2>Understanding the School Tier System</h2>\n\n\n<p>Not all international schools are created equal, and the tier system, while unofficial, is something every recruiter and experienced teacher understands. Getting this wrong can mean the difference between a life-changing two years and a contract you're counting down the days to escape.</p>\n\n\n<p>Tier 1 schools are the gold standard. They're typically nonprofit, have genuinely international student bodies (not just wealthy local families), hold multiple accreditations from bodies like CIS [7] and NEASC [8], and offer packages that let you save serious money. Teacher retention is high because people actually want to stay. These schools are selective; expect multiple interview rounds and a thorough vetting process.</p>\n\n\n<p>Tier 2 schools are where most international teachers end up, and that's not a bad thing. Compensation is solid if not spectacular. Student bodies lean more local. Benefits might not include business-class flights or full housing, but you'll still live well. The key difference is that Tier 2 schools vary wildly from one to the next. Some are Tier 1 in everything but name, while others barely clear the bar.</p>\n\n\n<p>Tier 3 is where you need to be careful. These are for-profit operations with variable quality. Some Tier 3 schools in hardship locations pay surprisingly well (certain schools in the Middle East and Central Asia fall here), but turnover is high for a reason. The teaching load is heavier, support is thinner, and the \"package\" might not cover what you'd expect.</p>\n\n\n<p>One quick rule of thumb: count the accreditations. Accreditations cost schools money and require meeting real standards [7]. A school with CIS and NEASC accreditation has invested in quality assurance. A school with zero accreditations? That tells you something.</p>\n\n\n<h2>Reading the Interview Process Like a Hiring Manager</h2>\n\n\n<p>The interview itself tells you as much about the school as your answers tell them about you. I've sat on both sides of the table, and the patterns are remarkably consistent.</p>\n\n\n<p>Tier 1 schools run multi-stage interviews. You'll talk to HR first, then the principal or department head, probably do a teaching demonstration, and sometimes meet the head of school. It feels like a lot. But that thoroughness signals something positive: they care who they hire, and the people making decisions are actually engaged in the process. Schools that rush through a single 20-minute Zoom call and offer you the job on the spot? That's not efficiency. That's desperation.</p>\n\n\n<p>Pay attention to the questions they ask you. Strong schools dig into differentiation strategies, how you handle conflict with colleagues, your approach to assessment and data. Weak schools ask whether you can start in August. The depth of their questions reflects the depth of their leadership.</p>\n\n\n<p>And turn the tables. You should be interviewing them just as hard. Ask about professional development budgets and whether teachers actually use them. Request a sample weekly schedule for someone in your role. Ask how the board interacts with school leadership. And always, always ask to speak with a current teacher in your department.</p>\n\n\n<p>That last one is gold. A school that connects you with current staff has nothing to hide. A school that dodges this request, or worse, only offers admin-curated references, is managing what you hear. I learned this the hard way at a school in Southeast Asia that gave me two glowing references, both from administrators. The teachers I eventually worked alongside told a very different story.</p>\n\n\n<h2>Before You Sign Anything</h2>\n\n\n<p>This is where teachers get burned. You get the offer, you're excited, you tell your family, maybe you start browsing apartments online. Stop. An offer letter is not a contract.</p>\n\n\n<p>Until you have a signed contract in hand, don't resign from your current position. Don't book flights. Don't break your lease. I've seen offers fall through at the last minute because of enrollment drops, budget changes, or schools simply finding a local hire who costs less. It happens more often than anyone in recruitment wants to admit.</p>\n\n\n<p>When the actual contract arrives, compare it line by line against the offer letter. Every single term. Here's what to verify:</p>\n\n\n<table><thead><tr><th>Detail</th><th>Why It Matters</th></tr></thead><tbody><tr><td>Currency and payment schedule</td><td>Some schools pay in local currency that fluctuates wildly</td></tr><tr><td>Net vs. gross salary</td><td>Tax obligations vary enormously by country</td></tr><tr><td>Housing: allowance vs. provided</td><td>A \"housing allowance\" in Hong Kong won't cover what you think</td></tr><tr><td>Flight allowance: frequency and class</td><td>Annual vs. biannual, economy vs. business, you alone vs. family</td></tr><tr><td>Health insurance: provider and coverage</td><td>\"International insurance\" can mean Cigna Global or a local clinic card</td></tr><tr><td>Contact hours vs. total hours on campus</td><td>20 teaching periods sounds light until the school day runs 7am to 5pm</td></tr><tr><td>Contract break penalties</td><td>Some schools hold final paychecks or blacklist through agencies</td></tr></tbody></table>\n\n\n<p>If the school gets evasive when you ask specific questions about any of this, that's data. Transparent institutions welcome thorough questioning. Schools that pressure you to sign fast or get visibly annoyed by detailed inquiries are telling you exactly what it's like to work there. Trust that signal.</p>\n\n\n<h2>Your First Move</h2>\n\n\n<p>The hiring season for most international schools runs October through March, with peak activity in January and February. If you're reading this during that window, you're already on the clock. Get your profiles up on at least two platforms this week, have your references lined up, and start researching specific schools before you apply broadly. The teachers who land the best positions aren't necessarily the ones with the most impressive CVs; they're the ones who did their homework first.</p>\n\n\n<h2>References</h2>\n\n\n<p>[1] <a href=\"https://www.searchassociates.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Search Associates</a></p>\n\n\n<p>[2] <a href=\"https://www.iss.edu/\" target=\"_blank\" rel=\"noopener noreferrer\">International Schools Services (ISS)</a></p>\n\n\n<p>[3] <a href=\"https://www.schrole.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Schrole</a></p>\n\n\n<p>[4] <a href=\"https://www.teacherhorizons.com/\" target=\"_blank\" rel=\"noopener noreferrer\">Teacher Horizons</a></p>\n\n\n<p>[5] <a href=\"https://www.tieonline.com\" target=\"_blank\" rel=\"noopener noreferrer\">TIE Online</a></p>\n\n\n<p>[6] <a href=\"https://www.internationalschoolsreview.com/\" target=\"_blank\" rel=\"noopener noreferrer\">International Schools Review</a></p>\n\n\n<p>[7] <a href=\"https://www.cois.org/\" target=\"_blank\" rel=\"noopener noreferrer\">Council of International Schools (CIS)</a></p>\n\n\n<p>[8] <a href=\"https://www.neasc.org/international\" target=\"_blank\" rel=\"noopener noreferrer\">NEASC Commission on International Education</a></p>\n\n<hr>\n\n<strong>About This Article</strong>\n\n<p>Written by School Transparency, with AI assistance (Claude Sonnet 4.5). Research data sourced from World Bank API, International Schools Review, Reddit education communities, and Numbeo cost of living data.</p>\n\n<strong>Tech Stack:</strong> n8n workflow automation, Google Sheets data management, Anthropic's APIs for content generation, custom web scrapers for real-time data collection.\n\n<em>School Transparency is committed to data-driven insights for international teachers. All articles combine human expertise with AI tools to provide comprehensive, current information.</em>\n\n<hr>\n",
  "category": "Job Search & Hiring",
  "subcategory": "Recruiting Fairs",
  "publishedDate": "2026-02-13",
  "author": "School Transparency",
  "featuredImage": "https://images.unsplash.com/photo-1586281380349-632531db7ed4?w=1200",
  "imageCredit": "Photo by <a href=\"https://unsplash.com/@vantaymedia?utm_source=school_transparency&utm_medium=referral\">Van Tay Media</a> on <a href=\"https://unsplash.com?utm_source=school_transparency&utm_medium=referral\">Unsplash</a>",
  "sources": [
    {
      "title": "Search Associates",
      "url": "https://www.searchassociates.com/"
    },
    {
      "title": "International Schools Services (ISS)",
      "url": "https://www.iss.edu/"
    },
    {
      "title": "Schrole",
      "url": "https://www.schrole.com/"
    },
    {
      "title": "Teacher Horizons",
      "url": "https://www.teacherhorizons.com/"
    },
    {
      "title": "TIE Online",
      "url": "https://www.tieonline.com"
    },
    {
      "title": "International Schools Review",
      "url": "https://www.internationalschoolsreview.com/"
    }
  ],
  "relatedArticles": [
    "timeline-for-applying-to-search-associates-vs-iss-recruiting-fairs-for-august-2026-positions",
    "due-diligence-guide-for-first-time-international-teachers",
    "what-questions-should-i-ask-about-workplace-culture-at-ib-schools-in-asia"
  ]
}