{
  "id": "how-to-assess-political-stability-risks-before-accepting-teaching-contract-in-myanmar",
  "title": "How to assess political stability risks before accepting teaching contract in Myanmar?",
  "slug": "how-to-assess-political-stability-risks-before-accepting-teaching-contract-in-myanmar",
  "excerpt": "Myanmar teaching contracts require assessing civil war risks, wrongful detention potential, and limited embassy protection. Only accept if you can handle real physical danger and have emergency exit funds ready.",
  "content": "<h1>How to Assess Political Stability Risks Before Taking a Teaching Contract in Myanmar</h1>\n\n<p>Myanmar presents one of the most complex decisions an international teacher can face. The country has a genuine need for qualified educators, schools that have continued operating through years of crisis, and a culture that many expats find deeply rewarding. It also has an active civil war, Level 4 \"Do Not Travel\" advisories from multiple governments, and risks that extend far beyond typical expat concerns. If you're considering a position there, you need a framework for evaluating whether the opportunity justifies the dangers, because this isn't a decision you can make based on salary and benefits alone.</p>\n\n<h2>Understanding the Current Situation</h2>\n\n<p>The political crisis that began with the February 2021 military coup has evolved into a full-scale civil war [1]. The junta held elections in late December 2025 and January 2026, but these took place amid ongoing armed conflict, with ethnic armed groups and opposition militias fighting the military across vast stretches of territory from the Bangladesh and India borders in the west to the China and Thailand frontiers in the north and east [2]. The voting period itself saw 408 documented military air attacks that killed at least 170 civilians [3].</p>\n\n<p>The numbers paint a grim picture. Civilian casualties have exceeded 5,350 since 2021, with over 3.5 million people internally displaced as of early 2025 [1]. The US State Department maintains a Level 4: Do Not Travel advisory citing armed conflict, civil unrest, arbitrary enforcement of local laws, poor healthcare infrastructure, landmines, and wrongful detentions [4]. Australia, Canada, and Singapore have issued similar warnings [5].</p>\n\n<p>International schools in Yangon have continued operating throughout the crisis. The International School of Myanmar serves around 520 students with a predominantly North American staff [6]. Network International School, the oldest British international school in the country, maintains BSO accreditation [7]. These schools haven't closed, but operating in a conflict zone changes the nature of the work in ways that job postings don't fully capture.</p>\n\n<h2>The Risks You're Actually Weighing</h2>\n\n<p>Political instability in Myanmar creates risks that differ fundamentally from the challenges of teaching in, say, a country with occasional protests or an unstable economy. You need to assess each category separately.</p>\n\n<strong>Physical safety</strong> varies dramatically by location. Yangon is classified as a \"green zone\" by the UK's Foreign Commonwealth and Development Office, meaning it's relatively safer than conflict areas [5]. But \"relatively safer\" still means an average of 21 explosions per month targeting regime personnel and facilities were recorded in Rangoon during 2024 [4]. You probably won't be targeted as a foreign teacher, but proximity to violence creates risk regardless of intent.\n\n<strong>Legal and detention risk</strong> is harder to quantify but potentially more serious. The US State Department has determined that American nationals face significant risk of wrongful detention by military regime authorities [4]. This isn't theoretical; it's an assessed likelihood. What constitutes suspicious behavior or a detainable offense shifts based on regime priorities and local commanders' discretion.\n\n<strong>Conscription</strong> represents a unique concern for anyone with claim to Myanmar citizenship. The law requires male citizens aged 18-35 and female citizens aged 18-27 to serve in the military [4]. If you have any family connection to Myanmar or could be considered to have citizenship claim, this risk applies to you in ways it wouldn't to teachers without such ties.\n\n<strong>Exit options</strong> become complicated during crises. When things deteriorate quickly (as they did during the 2021 coup), flights get cancelled, borders close, and evacuation becomes difficult. The March 2025 magnitude 7.7 earthquake near Sagaing and Mandalay demonstrated how quickly infrastructure can fail even without political causes [4].\n\n<h2>A Framework for Your Decision</h2>\n\n<p>Rather than asking \"Is Myanmar safe?\" (the answer is objectively no), ask yourself these specific questions:</p>\n\n<strong>What does the school's security protocol actually include?</strong> Good schools in high-risk environments have detailed emergency plans, relationships with evacuation services, and clear communication chains. Ask for specifics: Who monitors security conditions? How are staff notified of threats? What's the evacuation plan if commercial flights stop? If the school can't answer these questions concretely, they haven't done the work required to operate responsibly in this environment.\n\n<strong>What does your embassy actually provide?</strong> Register with your government's travel notification system before arrival. Understand what services your embassy can and cannot provide during a crisis. The US Embassy in Rangoon, for instance, has limited ability to assist citizens in detention or arrange evacuation during active conflict [4]. Don't assume your passport guarantees rescue.\n\n<strong>How does the contract address emergency situations?</strong> Some contracts include evacuation clauses, emergency flight provisions, and continued pay during displacement. Others leave you entirely on your own if you need to leave suddenly. Get this in writing before you sign, because verbal assurances mean nothing when the airport closes.\n\n<strong>What's your personal risk tolerance, honestly?</strong> Some teachers thrive in challenging environments and find the work meaningful precisely because it's difficult. Others discover that constant low-level anxiety about safety erodes their wellbeing and teaching effectiveness. Neither response is wrong, but you need to know yourself.\n\n<strong>Do you have dependents or health conditions?</strong> Healthcare infrastructure in Myanmar has deteriorated significantly since 2021. If you or a family member requires reliable medical care, this is probably not the right posting. Similarly, bringing children into an active conflict zone requires a different risk calculation than going alone.\n\n<h2>What Schools Won't Tell You</h2>\n\n<p>Schools recruiting for Myanmar positions have a conflict of interest: they need teachers, and emphasizing danger doesn't help recruitment. This doesn't mean they're dishonest, but it does mean you shouldn't rely solely on their assessment.</p>\n\n<p>Talk to teachers who have worked there recently, not just during the pre-coup years. The experience of teaching in Yangon in 2019 bears little resemblance to teaching there in 2025. Ask specifically: Have you ever felt unsafe? What's the worst security incident you've experienced? Would you bring your family? Would you sign another contract?</p>\n\n<p>Check International Schools Review for unfiltered perspectives. Read travel forums and expat groups, understanding that you'll find both alarmism and dangerous minimization. Look for patterns rather than individual opinions.</p>\n\n<h2>The Honest Calculation</h2>\n\n<p>Some teachers will read the risks outlined here and decide Myanmar isn't for them. That's a reasonable conclusion based on available evidence. The governments of multiple developed nations have officially advised their citizens not to go.</p>\n\n<p>Other teachers will weigh the same information and decide to accept positions anyway. They might have adventurous dispositions, believe strongly in the educational mission, or have personal connections to the country that make the risk feel worthwhile. Some will have productive, meaningful experiences. A small number will encounter serious problems.</p>\n\n<p>What you shouldn't do is take a Myanmar contract while telling yourself the warnings are overblown, the danger is exaggerated, or bad things only happen to other people. If you go, go with eyes open. Have an emergency fund that can cover last-minute flights. Know where your embassy is. Keep your important documents accessible. Understand that you're making a choice that carries real consequences, and take responsibility for that choice rather than pretending the risks don't exist.</p>\n\n<p>The schools in Myanmar are educating students who deserve qualified teachers. That mission has value. But so does your safety, and only you can decide where the balance lies.</p>\n\n<h2>References</h2>\n\n<p>[1] <a href=\"https://www.cfr.org/global-conflict-tracker/conflict/rohingya-crisis-myanmar\" target=\"_blank\" rel=\"noopener noreferrer\">Civil War in Myanmar</a> - Council on Foreign Relations Global Conflict Tracker</p>\n\n<p>[2] <a href=\"https://www.aljazeera.com/news/2025/12/27/whats-happening-in-myanmars-civil-war-as-military-holds-elections\" target=\"_blank\" rel=\"noopener noreferrer\">What's Happening in Myanmar's Civil War as Military Stages Elections</a> - Al Jazeera</p>\n\n<p>[3] <a href=\"https://anfrel.org/myanmar-a-junta-staged-election-in-the-midst-of-a-war-data-dive-issue-no-25/\" target=\"_blank\" rel=\"noopener noreferrer\">Myanmar: A Junta-Staged Election in the Midst of a War</a> - Asian Network for Free Elections</p>\n\n<p>[4] <a href=\"https://travel.state.gov/content/travel/en/traveladvisories/traveladvisories/burma-travel-advisory.html\" target=\"_blank\" rel=\"noopener noreferrer\">Burma (Myanmar) Travel Advisory</a> - US State Department</p>\n\n<p>[5] <a href=\"https://www.smartraveller.gov.au/destinations/asia/myanmar\" target=\"_blank\" rel=\"noopener noreferrer\">Myanmar Travel Advice & Safety</a> - Australian Government Smartraveller</p>\n\n<p>[6] <a href=\"https://www.ismyanmar.com/\" target=\"_blank\" rel=\"noopener noreferrer\">International School of Myanmar</a> - ISM Official Website</p>\n\n<p>[7] <a href=\"https://www.searchassociates.com/news-events/teach-abroad-with-the-oldest-british-international-school-in-myanmar/\" target=\"_blank\" rel=\"noopener noreferrer\">Teach Abroad with the Oldest British International School in Myanmar</a> - Search Associates</p>\n\n\n\n<hr>\n\n<strong>About This Article</strong>\n\n<p>Written by School Transparency, with AI assistance (Claude Sonnet 4.5). Research data sourced from World Bank API, International Schools Review, Reddit education communities, and Numbeo cost of living data.</p>\n\n<strong>Tech Stack:</strong> n8n workflow automation, Google Sheets data management, Anthropic's APIs for content generation, custom web scrapers for real-time data collection.\n\n<em>School Transparency is committed to data-driven insights for international teachers. All articles combine human expertise with AI tools to provide comprehensive, current information.</em>\n\n<hr>\n",
  "category": "Quality of Life",
  "subcategory": "Safety & Security",
  "publishedDate": "2026-02-06",
  "author": "School Transparency",
  "featuredImage": "https://images.unsplash.com/photo-1701355201371-fe26bc41f095?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4NDM5OTl8MHwxfHNlYXJjaHwxfHxlZHVjYXRpb24lMjBhc3Nlc3MlMjBwb2xpdGljYWwlMjBzdGFiaWxpdHklMjByaXNrc3xlbnwwfHx8fDE3NzAyODk3MDd8MA&ixlib=rb-4.1.0&q=80&w=1080",
  "sources": [
    {
      "title": "Civil War in Myanmar",
      "url": "https://www.cfr.org/global-conflict-tracker/conflict/rohingya-crisis-myanmar"
    },
    {
      "title": "What's Happening in Myanmar's Civil War as Military Stages Elections",
      "url": "https://www.aljazeera.com/news/2025/12/27/whats-happening-in-myanmars-civil-war-as-military-holds-elections"
    },
    {
      "title": "Myanmar: A Junta-Staged Election in the Midst of a War",
      "url": "https://anfrel.org/myanmar-a-junta-staged-election-in-the-midst-of-a-war-data-dive-issue-no-25/"
    },
    {
      "title": "Burma (Myanmar) Travel Advisory",
      "url": "https://travel.state.gov/content/travel/en/traveladvisories/traveladvisories/burma-travel-advisory.html"
    },
    {
      "title": "Myanmar Travel Advice & Safety",
      "url": "https://www.smartraveller.gov.au/destinations/asia/myanmar"
    },
    {
      "title": "International School of Myanmar",
      "url": "https://www.ismyanmar.com/"
    },
    {
      "title": "Teach Abroad with the Oldest British International School in Myanmar",
      "url": "https://www.searchassociates.com/news-events/teach-abroad-with-the-oldest-british-international-school-in-myanmar/"
    }
  ],
  "relatedArticles": []
}