{
  "id": "timeline-for-applying-to-search-associates-vs-iss-recruiting-fairs-for-august-2026-positions",
  "title": "Timeline for applying to Search Associates vs ISS recruiting fairs for August 2026 positions",
  "slug": "timeline-for-applying-to-search-associates-vs-iss-recruiting-fairs-for-august-2026-positions",
  "excerpt": "Search Associates offers 1,000+ schools with personal advocate support for $225, while ISS provides 400 schools with modern self-directed tools for $75. Both platforms dominate international hiring, with major fairs happening now through March for August 2026 positions.",
  "content": "<p>﻿# Search Associates vs ISS: The Complete Recruiting Timeline for August 2026 Positions\r</p>\n\r\n\r\n<p>If you're reading this in early 2026 and hoping to land an international teaching position for August, I have good news and bad news. The bad news: you're entering the most intense phase of the hiring cycle right now, and the best positions at top-tier schools may already have offers out. The good news: there are still thousands of jobs to be filled, the major fairs are either happening right now or just around the corner, and teachers who move strategically in the next eight weeks can absolutely land excellent placements. I've helped dozens of teachers through this process, and February is far from too late.\r</p>\n\r\n\r\n<p>But before we get into timing, you need to understand the two platforms that dominate international school recruiting. Search Associates and ISS (International Schools Services) are the gatekeepers for the majority of international school job fairs, and choosing between them (or using both) is one of the first decisions you'll make. They're different in ways that matter, and understanding those differences will shape your entire strategy.\r</p>\n\r\n\r\n<h2>Search Associates vs ISS: How They Compare\r</h2>\n\r\n\r\n<p>Search Associates is the older and larger of the two platforms, with a database of roughly 1,000 international schools [1]. Every candidate is assigned a personal Associate who reviews your profile, manages your references, and helps match you to schools. The process is hands-on. Your Associate knows your file, knows the schools, and can advocate for you behind the scenes in ways that a digital platform can't. That personal touch is what Search is known for, and it's why many top-tier schools recruit exclusively through Search fairs.\r</p>\n\r\n\r\n<p>The fee reflects this. Registration runs around $225, though exact pricing can vary [1]. That buys you access to the full job board, the ability to request fair invitations, and the reference management system that schools rely on when evaluating candidates.\r</p>\n\r\n\r\n<p>ISS takes a different approach. Their platform is more digital-first, with a modern online portal where you browse verified listings and manage applications. Full candidate membership costs roughly $75, and basic registration is free with limited features [2]. ISS runs fewer in-person fairs but supplements them with virtual fairs, which expanded significantly during the pandemic and have stuck around because schools in remote regions find them useful. ISS also offers professional development webinars and workshops as part of their platform, which Search doesn't.\r</p>\n\r\n\r\n<p>Here's the honest comparison:\r</p>\n\r\n\r\n<table><thead><tr><th>Feature</th><th>Search Associates</th><th>ISS</th></tr></thead><tbody><tr><td>Schools in database</td><td>~1,000</td><td>~400</td></tr><tr><td>Registration cost</td><td>~$225</td><td>~$75 (full access)</td></tr><tr><td>Personal support</td><td>Dedicated Associate</td><td>Self-directed with portal</td></tr><tr><td>Fair format</td><td>In-person only</td><td>In-person + virtual</td></tr><tr><td>Fair locations (2026)</td><td>Hong Kong, Cambridge, Toronto, London, Dubai, Singapore</td><td>Virtual iFair, ICMEC, Asia-Pacific Expos</td></tr><tr><td>School tier</td><td>Skews toward top-tier international</td><td>Broad range, strong across regions</td></tr><tr><td>Platform feel</td><td>Traditional, relationship-based</td><td>Digital, modern interface</td></tr></tbody></table>\n\r\n\r\n<p>Neither platform is objectively better. Search gives you more schools and more personal support. ISS gives you flexibility and lower cost. The strongest candidates register for both, which runs you about $300 total and gives you access to virtually every international school that recruits through agencies [1].\r</p>\n\r\n\r\n<h2>The Other Platforms Worth Knowing\r</h2>\n\r\n\r\n<p>Search and ISS aren't the only game in town. TIE Online costs $39 and lists a solid range of positions, particularly useful as a supplement rather than a primary platform [1]. TES is free and has strong coverage of British curriculum schools worldwide. And Schrole isn't a recruiting agency at all; it's an application management system that some schools use, so you may encounter it when applying directly [1].\r</p>\n\r\n\r\n<p>Many experienced international teachers also apply directly to schools through their websites, bypassing agencies entirely. This works well when you know exactly which schools you want and can research them thoroughly. But if you're early in your international career or casting a wide net, the platforms are worth the investment because they aggregate opportunities you'd never find on your own.\r</p>\n\r\n\r\n<h2>The Month-by-Month Recruiting Timeline\r</h2>\n\r\n\r\n<p>International school recruiting follows a predictable cycle, and understanding it gives you a genuine strategic advantage. The cycle for August 2026 positions technically started in June 2025, but the peak window is October through March [3]. Here's what each phase looks like:\r</p>\n\r\n\r\n<h3>June to August 2025: The Quiet Start\r</h3>\n\r\n\r\n<p>Search Associates opens its new recruiting cycle on June 1st each year [3]. Returning candidates update their profiles. New candidates begin the registration process. Schools start posting administrative and senior leadership vacancies first. By August, teaching positions begin appearing, and fair registration opens on August 15th. If you weren't active during this window, you missed the early movers, but you didn't miss much in terms of volume.\r</p>\n\r\n\r\n<h3>September to November 2025: Building Momentum\r</h3>\n\r\n\r\n<p>Schools continue posting vacancies, and the number grows steadily. Elite-tier schools often begin recruiting in late October and early November, targeting candidates they've identified through Search Associates or internal referrals [3]. This is when strategic candidates achieve \"active\" status on their platforms and start requesting invitations to January fairs. By November, serious candidates have researched target schools, updated their references, and prepared their interview materials.\r</p>\n\r\n\r\n<h3>December 2025 to February 2026: The Tidal Wave\r</h3>\n\r\n\r\n<p>This is the peak. Over 3,000 jobs get posted by January [3]. Teachers who have decided not to renew their contracts have given notice, so schools know exactly which positions they need to fill. The major fairs happen during this window:\r</p>\n\r\n\r\n<table><thead><tr><th>Fair</th><th>Location</th><th>Dates</th></tr></thead><tbody><tr><td>Search Associates</td><td>Hong Kong</td><td>January 16-18, 2026</td></tr><tr><td>Search Associates</td><td>Cambridge, USA</td><td>January 23-26, 2026</td></tr><tr><td>Search Associates</td><td>Toronto</td><td>February 6-8, 2026</td></tr><tr><td>ISS Virtual iFair</td><td>Online</td><td>March 7, 2026</td></tr><tr><td>Search Associates</td><td>London (Spring)</td><td>March 14-15, 2026</td></tr><tr><td>Search Associates</td><td>Dubai (Spring)</td><td>April 11, 2026</td></tr></tbody></table>\n\r\n\r\n<p>January and February are when the majority of contracts get signed. If you're attending a fair, this is the period where you might interview with six schools in a weekend and leave with an offer. The pace is intense, and preparation matters enormously. Schools at fairs are ready to hire; they don't come to browse.\r</p>\n\r\n\r\n<h3>March to June 2026: The Long Tail\r</h3>\n\r\n\r\n<p>Roughly 1,000 positions remain available after the peak window [3]. These include late resignations, newly created positions, and schools that didn't find the right fit during the fairs. The competition is lighter, but so is the selection. Some excellent opportunities appear here, particularly at schools that had unexpected departures or received late funding for new positions. The ISS Virtual iFair in March and Search's London Spring and Dubai Spring fairs serve this phase well.\r</p>\n\r\n\r\n<h3>July to August 2026: Last-Minute Scramble\r</h3>\n\r\n\r\n<p>Positions still trickle in through the summer. These are almost always urgent fills: a teacher pulled out of a signed contract, a school expanded a grade level, or somebody's visa fell through. The quality varies widely. You might find a hidden gem or you might find the position nobody else wanted. If you're flexible on location and school type, this window can work. If you're selective, it's stressful.\r</p>\n\r\n\r\n<h2>Where You Stand Right Now (February 2026)\r</h2>\n\r\n\r\n<p>If you're reading this in February 2026, here's your honest assessment. The January fairs in Hong Kong and Cambridge have passed. Toronto is right now or just finished. You've missed the first wave of peak hiring, and the most sought-after positions at the most prestigious schools are likely filled or in final rounds.\r</p>\n\r\n\r\n<p>But that doesn't mean you're out of options. Far from it. The majority of hiring volume happens across the full October-to-March window, and plenty of strong schools are still actively recruiting in February and March. Here's what to do right now:\r</p>\n\r\n\r\n<p>Register on Search Associates and ISS immediately if you haven't already. Search's registration involves a verification process that takes time, so don't delay. Request invitations to the London Spring fair (March 14-15) and the Dubai Spring fair (April 11). Sign up for the ISS Virtual iFair on March 7. Start applying directly to schools through their websites in parallel; don't wait for fair invitations to begin conversations.\r</p>\n\r\n\r\n<p>If you're planning ahead for August 2027 instead, you're in the ideal position. Start your Search Associates registration this spring, get your references lined up over the summer, and be active and ready when the cycle opens in June 2026. The teachers who do best at January fairs aren't the ones who registered in December. They're the ones who spent six months building their profiles and researching schools.\r</p>\n\r\n\r\n<h2>What Actually Happens at a Recruiting Fair\r</h2>\n\r\n\r\n<p>If you've never attended an international school recruiting fair, it helps to know what you're walking into. These aren't career fairs where you wander between booths collecting brochures. They're structured, high-stakes interview weekends where schools and candidates are matched in advance.\r</p>\n\r\n\r\n<p>At a Search Associates fair, you'll receive a schedule of interviews before you arrive. Schools request candidates based on profiles, and candidates request schools based on postings. Your Associate may recommend specific schools that match your profile. Over two to three days, you'll sit through back-to-back interviews, sometimes eight or ten in a weekend. Some schools make offers on the spot. Others follow up within days.\r</p>\n\r\n\r\n<p>The preparation that matters most isn't polishing your resume (though do that too). It's researching every school on your interview list so you can ask specific questions about curriculum, leadership stability, faculty turnover, and the things that actually determine whether a school is a good fit. Hiring committees notice when a candidate has done their homework, and they notice even more when a candidate hasn't.\r</p>\n\r\n\r\n<p>One practical tip that sounds small but isn't: bring multiple copies of everything. Your passport, your certifications, your transcripts, your reference letters. Fair venues are busy, printers are scarce, and nothing kills momentum like scrambling for a document between interviews.\r</p>\n\r\n\r\n<p>The teachers who get the best outcomes from fairs are the ones who treat them as a two-way evaluation. You're interviewing the school as much as they're interviewing you. Ask about teacher retention. Ask what happened to the person who last held the position. Ask how conflicts between teachers and administration are handled. The answers, and sometimes the non-answers, tell you everything.\r</p>\n\r\n\r\n<h2>References\r</h2>\n\r\n\r\n<p>[1] <a href=\"https://worldclasseducators.com/2025/10/27/search-associates-vs-iss-which-international-school-recruitment-agency-is-right-for-you/\" target=\"_blank\" rel=\"noopener noreferrer\">Search Associates vs ISS: Which Recruitment Agency Is Right for You - World Class Educators</a>\r</p>\n\r\n\r\n<p>[2] <a href=\"https://www.iss.edu/services/teacher-recruitment/job-fairs\" target=\"_blank\" rel=\"noopener noreferrer\">International Job Fairs - ISS</a>\r</p>\n\r\n\r\n<p>[3] <a href=\"https://ca.searchassociates.com/international-school-recruiting-timeline/\" target=\"_blank\" rel=\"noopener noreferrer\">International School Recruiting Timeline - Search Associates</a>\r</p>\n\r\n\r\n<p>[4] <a href=\"https://www.searchassociates.com/job-fairs/\" target=\"_blank\" rel=\"noopener noreferrer\">Job Fair Schedule - Search Associates</a></p>\n\n<hr>\n\n<strong>About This Article</strong>\n\n<p>Written by School Transparency, with AI assistance (Claude Sonnet 4.5). Research data sourced from World Bank API, International Schools Review, Reddit education communities, and Numbeo cost of living data.</p>\n\n<strong>Tech Stack:</strong> n8n workflow automation, Google Sheets data management, Anthropic's APIs for content generation, custom web scrapers for real-time data collection.\n\n<em>School Transparency is committed to data-driven insights for international teachers. All articles combine human expertise with AI tools to provide comprehensive, current information.</em>\n\n<hr>\n",
  "category": "Job Search & Hiring",
  "subcategory": "Recruiting Fairs",
  "publishedDate": "2026-02-10",
  "author": "School Transparency",
  "featuredImage": "https://images.unsplash.com/photo-1599319980787-d850b3c8f9b1?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4NDM5OTl8MHwxfHNlYXJjaHwxfHxlZHVjYXRpb24lMjBUaW1lbGluZSUyMGFwcGx5aW5nJTIwU2VhcmNoJTIwQXNzb2NpYXRlc3xlbnwwfHx8fDE3NzA3MjIyNTZ8MA&ixlib=rb-4.1.0&q=80&w=1080",
  "imageCredit": "Photo by <a href=\"https://unsplash.com/@vinceveras?utm_source=school_transparency&utm_medium=referral\">Vince Veras</a> on <a href=\"https://unsplash.com?utm_source=school_transparency&utm_medium=referral\">Unsplash</a>",
  "sources": [],
  "relatedArticles": [
    "due-diligence-guide-for-first-time-international-teachers",
    "what-questions-should-i-ask-about-workplace-culture-at-ib-schools-in-asia",
    "should-experienced-ib-teachers-use-recruiters-or-apply-directly-to-schools-in-dubai"
  ]
}