{
  "id": "what-happens-to-your-contract-if-your-school-closes-during-a-crisis",
  "title": "What Happens to Your Contract If Your International School Closes During a Crisis",
  "slug": "what-happens-to-your-contract-if-your-school-closes-during-a-crisis",
  "excerpt": "International teachers often don't realize their contract's force majeure clause determines whether they'll get paid during a crisis. Most agreements are vague about salary continuation when schools move online or close suddenly.",
  "content": "<h1>What Happens to Your Contract If Your International School Closes During a Crisis</h1>\n\n\n<p>It's Tuesday morning. You're at your kitchen table with two kids doing remote learning on one laptop while you're supposed to teach online on another. Your spouse is in the next room on a work call. Your internet keeps dropping. An email lands: salaries will be \"temporarily reduced\" because the school is invoking a force majeure clause due to the regional situation.</p>\n\n\n<p>This isn't theoretical anymore. When schools close, teachers discover that contract language they barely read becomes the only thing standing between them and financial collapse. Most contracts are shockingly vague about what happens next.</p>\n\n\n<h2>What Force Majeure Actually Means</h2>\n\n\n<p>Almost every international school contract includes a force majeure clause. It usually reads something like: \"In the event of war, government action, natural disaster, or circumstances beyond the reasonable control of either party, the school may suspend its normal operations.\"</p>\n\n\n<p>The problem: \"suspend operations\" can mean wildly different things. Does it mean the school stops paying you? Does it mean you teach online for full pay? Does it mean you can break your contract without penalty? The answer depends on the exact wording of your specific contract, your school's financial stability, and the labor laws where you're teaching.</p>\n\n\n<p>Force majeure is a legal concept that says: when extraordinary circumstances make it genuinely impossible to fulfill a contract, neither party is liable for breach. The key word is impossible. If your school can shift to online teaching, most labor courts would argue the contract obligations continue (just the delivery method changes). If your government orders buildings closed, that's clearer. If your school simply doesn't want to pay for remote technology, that's not force majeure.</p>\n\n\n<p>Most teachers end up in the gray zone between these two extremes.</p>\n\n\n<h2>What Actually Happens to Your Salary</h2>\n\n\n<p>If your school moves to remote instruction due to a crisis, are you still paid your full salary?</p>\n\n\n<p>Probably yes. But check your contract immediately.</p>\n\n\n<p>Most schools that can afford it treat remote instruction as a continuation of normal employment. You're still teaching. Your classroom is now on Zoom instead of in a building, but you're doing the job you were hired for. You get your full salary. Benefits continue. Your mortgage or rent still gets paid.</p>\n\n\n<p>Some schools see a crisis as an opportunity to cut costs. I've heard of schools trying to reduce salaries by 20 to 30 percent during remote periods, claiming \"benefits are reduced\" because teachers aren't using school facilities. This is a weak legal argument in most jurisdictions. Schools try it anyway.</p>\n\n\n<p>The strongest position is a contract that explicitly states: \"In the event of school closure, remote instruction, or force majeure circumstances, teachers receive their full salary including all benefits, housing provisions, and insurance.\" Almost no contracts say this. What they actually say is vague enough to give schools room to negotiate downward when finances tighten.</p>\n\n\n<p>If your school was already financially fragile before the crisis, that's when you find out whether your contract actually protects you or just looks like it does.</p>\n\n\n<h2>Your House, Your Family, Your Life</h2>\n\n\n<p>Here's what contracts don't account for: you're not living in a dorm room. You're in a house or apartment you rent or own. You've got a spouse who works from home, kids doing school from the kitchen table, maybe a dog. You need space for teaching that doesn't sound like a family living room during a Zoom call.</p>\n\n\n<p>COVID taught teachers the hard way that \"just teach from home\" isn't that simple when home is where your actual life happens. You need reliable internet. Most schools won't pay for an upgrade, even if your home connection can't handle multiple video streams. You need a quiet, separate space for teaching. In a busy household, that space might not exist or might require everyone else to be silent during your teaching hours.</p>\n\n\n<p>You're expected to shift your entire teaching practice to an online platform. Some schools provide training. Most expect you to figure it out. Meanwhile, you're managing:</p>\n\n\n<p>- Kids who are also learning remotely and need your attention between classes</p>\n<p>- Aging parents who live with you</p>\n<p>- Your spouse's job, which also requires focus and quiet</p>\n<p>- Pets that have no concept of work-from-home etiquette</p>\n<p>- The stress and distraction of a crisis happening around you</p>\n\n\n<p>Your contract says you'll teach. It doesn't say anything about this. Which means you absorb all these complications into your \"normal\" job performance with no adjustment to expectations or workload.</p>\n\n\n<h2>Can You Break Your Contract If the School Closes</h2>\n\n\n<p>Probably not. At least not without financial penalty.</p>\n\n\n<p>If your school invokes force majeure, the school is typically released from its obligation to provide in-person instruction. Most contracts don't give you the reciprocal right to break your contract just because the school is closed. You're stuck in a holding pattern. The school isn't technically in breach (because they're covered by force majeure), but they're also not providing the working conditions you signed up for.</p>\n\n\n<p>The exceptions: when the closure is genuinely indefinite or when the school explicitly terminates your contract due to financial collapse. If the school formally ends your contract, you may be owed severance. This varies dramatically by country and contract terms. Some schools handle this correctly. Others simply stop paying you and hope you eventually give up.</p>\n\n\n<h2>What Happens With Housing</h2>\n\n\n<p>If your school provides housing allowance or directly rents accommodation for you, the situation is more straightforward than many articles suggest. You're still employed. You still need to live somewhere. The school's obligation to house you typically continues.</p>\n\n\n<p>Some schools will try to reduce your housing allowance during a crisis, claiming your circumstances have changed. A few might pressure you to move to cheaper accommodation. Push back. Unless your contract explicitly includes language saying housing can be reduced during force majeure (and most don't), the school's obligation stands.</p>\n\n\n<p>If your school closes for an extended period and you're remote, some schools might ask whether you want to stay in expensive housing or relocate to be closer to family. That's not them cutting your housing. It's them offering flexibility. If they're offering to cover housing costs wherever you go, that's actually favorable. If they're asking you to move to cheaper accommodation to reduce their costs, that's different.</p>\n\n\n<p>Get any changes to your housing arrangement in writing. Don't accept verbal promises. Schools change their minds when finances tighten.</p>\n\n\n<h2>Return Flights and Insurance</h2>\n\n\n<p>Many contracts promise to cover flights home at the end of your contract term. If your school closes mid-year due to a crisis, do they still owe you a flight?</p>\n\n\n<p>Most schools argue they don't. They claim force majeure exempts them from expensive obligations. This is a weaker legal argument in most countries. Schools try it anyway. Your best protection is a contract that explicitly states: \"Return flights are guaranteed regardless of contract termination due to force majeure.\"</p>\n\n\n<p>Health insurance is usually suspended the day the school formally closes. Particularly grim if you're in a country with expensive private healthcare. Some schools extend insurance for 30 days as a courtesy. Many don't. If you're facing an extended closure, clarity on insurance continuation is urgent.</p>\n\n\n<h2>What to Check in Your Contract Right Now</h2>\n\n\n<p>Look for these specific provisions:</p>\n\n\n<strong>Force majeure definition.</strong> Does it spell out exactly what circumstances trigger it? \"War, government action, natural disaster\" is vague. Does a regional conflict count? A government advisory against travel? A school's financial crisis? The more specifically defined, the better. Vagueness tends to favor the school.\n\n\n<strong>Compensation during force majeure.</strong> What's your salary situation if the school closes? Is it explicitly guaranteed or does it say \"school will make reasonable efforts\"? Get a guarantee in writing.\n\n\n<strong>Remote instruction terms.</strong> If schools must close but can teach online, what are your obligations? What technology will the school provide? Can you be required to teach without adequate preparation or support? Can your salary be reduced for teaching online? This should be spelled out.\n\n\n<strong>Housing during closure.</strong> If the school closes, does housing continue? For how long? Can you relocate at the school's expense? Get this in writing.\n\n\n<strong>Return flights and insurance.</strong> If the school closes and you need to leave, does the school cover your flight? Is insurance continued or does the school provide evacuation insurance? Get this guaranteed in the contract.\n\n\n<strong>Severance if the school closes.</strong> What do you get if the school permanently closes or can't pay you? Some contracts include severance tied to force majeure. Most don't.\n\n\n<h2>If This Is Happening to You Right Now</h2>\n\n\n<p>If your school has closed or is about to, do this:</p>\n\n\n<strong>Get everything in writing.</strong> Don't rely on staff meetings or casual conversations. Request written confirmation of your salary status, housing situation, expected return date (if applicable), and any insurance or flight coverage. Email the school's HR: \"Just to confirm our conversation today...\" and paste what you understand to be the agreement.\n\n\n<strong>Know your country's labor laws.</strong> If you're teaching in a country with strong labor protections, the school can't simply zero your salary or cut housing because of force majeure. If you're in a country with weaker protections, the school has more leverage. Contact a local employment lawyer if closure is likely to be extended.\n\n\n<strong>Contact your embassy.</strong> Register with your home country's diplomatic mission. They can provide information about evacuation routes, repatriation flights, emergency loans if the school doesn't pay you, and legal resources in your host country.\n\n\n<strong>Talk to other teachers.</strong> You're not the only one dealing with this. Other teachers at your school may have already negotiated solutions. Sometimes schools negotiate collectively with staff, which gives you more leverage.\n\n\n<strong>Document everything.</strong> Keep copies of all communications from the school about the closure, salary, housing, and return. You may need this as proof if you pursue compensation later.\n\n\n<h2>The Real Situation</h2>\n\n\n<p>International school contracts are written to favor schools during normal times. When a crisis hits, most contracts are barely tested. Schools interpret force majeure clauses in whatever way minimizes their costs. The teachers who do best are those who had strong contracts from the start and those who negotiate immediately when crisis hits, before the school's financial situation deteriorates.</p>\n\n\n<p>If you're signing a contract with an international school in any region with geopolitical instability, push for explicit language around what happens if the school closes. Don't accept vague language about \"reasonable efforts.\" The school would push back if the situation were reversed.</p>\n\n\n<h2>References</h2>\n\n\n<p>[1] <a href=\"https://www.teachaway.com/blog/understanding-international-teaching-contracts\" target=\"_blank\" rel=\"noopener noreferrer\">Understanding International Teaching Contracts</a></p>\n\n\n<p>[2] <a href=\"https://www.clements.com/resources/employee-protection/risk-management-international-schools-protecting-students-staff/\" target=\"_blank\" rel=\"noopener noreferrer\">Risk Management for International Schools: Protecting Students and Staff</a></p>\n\n\n<p>[3] <a href=\"https://teachertaskforce.org/blog/how-covid-19-pandemic-affecting-contract-teachers-sub-saharan-africa\" target=\"_blank\" rel=\"noopener noreferrer\">How the COVID-19 Pandemic Affected Contract Teachers</a></p>\n\n\n<p>[4] <a href=\"https://inee.org/resources/protecting-education-insecurity-and-armed-conflict-international-law-handbook\" target=\"_blank\" rel=\"noopener noreferrer\">Protecting Education in Insecurity and Armed Conflict</a></p>\n\n<hr>\n\n<strong>About This Article</strong>\n\n<p>Written by School Transparency, with AI assistance (Claude Sonnet 4.5). Research data sourced from World Bank API, International Schools Review, Reddit education communities, and Numbeo cost of living data.</p>\n\n<strong>Tech Stack:</strong> n8n workflow automation, Google Sheets data management, Anthropic's APIs for content generation, custom web scrapers for real-time data collection.\n\n<em>School Transparency is committed to data-driven insights for international teachers. All articles combine human expertise with AI tools to provide comprehensive, current information.</em>\n\n<hr>\n",
  "category": "Contracts & Salaries",
  "subcategory": "Contract Negotiation",
  "publishedDate": "2026-03-01",
  "author": "School Transparency",
  "featuredImage": "https://images.unsplash.com/photo-1450101499163-c8848c66ca85?w=1200",
  "imageCredit": "Photo by <a href=\"https://unsplash.com/@homajob?utm_source=school_transparency&utm_medium=referral\">Scott Graham</a> on <a href=\"https://unsplash.com?utm_source=school_transparency&utm_medium=referral\">Unsplash</a>",
  "sources": [
    {
      "title": "Understanding International Teaching Contracts",
      "url": "https://www.teachaway.com/blog/understanding-international-teaching-contracts"
    },
    {
      "title": "Risk Management for International Schools: Protecting Students and Staff",
      "url": "https://www.clements.com/resources/employee-protection/risk-management-international-schools-protecting-students-staff/"
    },
    {
      "title": "How the COVID-19 Pandemic Affected Contract Teachers",
      "url": "https://teachertaskforce.org/blog/how-covid-19-pandemic-affecting-contract-teachers-sub-saharan-africa"
    },
    {
      "title": "Protecting Education in Insecurity and Armed Conflict",
      "url": "https://inee.org/resources/protecting-education-insecurity-and-armed-conflict-international-law-handbook"
    }
  ],
  "relatedArticles": [
    "what-happens-to-your-contract-if-your-school-closes-during-a-geopolitical-crisis",
    "what-happens-if-my-international-school-doesn-t-renew-my-contract-during-probationary-period",
    "how-does-jamaica-s-economic-growth-impact-international-school-teacher-benefits"
  ]
}