{
  "id": "what-happens-if-i-get-sick-during-probation-period-at-international-schools-in-asia",
  "title": "What happens if I get sick during probation period at international schools in Asia?",
  "slug": "what-happens-if-i-get-sick-during-probation-period-at-international-schools-in-asia",
  "excerpt": "Your school contract and local labor law create two separate sick leave systems that don't always align. Understanding both before you need them is the difference between a minor setback and a career crisis during probation.",
  "content": "<h1>What Actually Happens When You Get Sick During Probation at International Schools in Asia</h1>\n\n\n<p>Nobody moves halfway around the world expecting to spend their first month in bed with a respiratory infection. But it happens more often than you'd think. New climate, new food, new stress levels, a body that hasn't built up local immunities yet. I've seen it hit teachers within their first two weeks, and the timing couldn't be worse: they're still on probation, still proving themselves, and suddenly terrified that calling in sick will cost them the job they just uprooted their life for.</p>\n\n\n<p>Here's the thing most teachers don't realize until it's too late: there are two separate systems that determine your sick leave rights. Your school contract offers one set of rules, and local labor law provides another. They don't always agree, and knowing where the gaps are before you need to use a sick day is what separates a minor inconvenience from a career crisis.</p>\n\n\n<h2>What Your Contract Probably Says</h2>\n\n\n<p>Most international school contracts in Asia include roughly 10 paid sick days per year. That's the industry standard, give or take. Some schools offer 7, some offer 12, but 10 is the number you'll see most often whether you're signing with a school in Dubai, Bangkok, or Shanghai. These contractual sick days typically apply from your start date, including during probation, because they're part of your employment package rather than something you \"earn\" over time.</p>\n\n\n<p>The important detail is what happens if you blow through those 10 days. Some contracts specify unpaid leave beyond the allowance. Others have language that allows the school to deduct from your salary or, in more aggressive contracts, treat excessive absence as grounds for termination. During probation, that termination clause carries extra weight because the notice period is shorter and the threshold for letting someone go is lower.</p>\n\n\n<p>A few things to look for in the fine print: Does your contract require a medical certificate after a certain number of consecutive days? Most do, usually after two or three days. Can sick days be used for dependents, or only personal illness? And critically, does the contract distinguish between probation and post-probation sick leave? Most don't, but some schools in the UAE quietly include language that limits paid sick days during the trial period. If you see that, ask about it before you sign.</p>\n\n\n<h2>What the Law Says (It's Different)</h2>\n\n\n<p>Your contract is one layer. Local labor law is another, and it exists as a floor beneath whatever the school offers. In practice, most international schools exceed the legal minimum, so your contract is what you'll use day-to-day. But if things go sideways during probation, knowing your legal rights becomes the difference between having options and having none.</p>\n\n\n<table><thead><tr><th>Country</th><th>Probation Length</th><th>Contract Standard (Typical)</th><th>Legal Minimum During Probation</th><th>Legal Termination Protection</th></tr></thead><tbody><tr><td>UAE</td><td>Up to 6 months</td><td>~10 paid sick days/year</td><td>No legal entitlement during probation</td><td>None during probation</td></tr><tr><td>Thailand</td><td>Typically 119 days</td><td>~10 paid sick days/year</td><td>30 paid sick days/year from day one</td><td>Severance required after 120 days</td></tr><tr><td>China</td><td>1-6 months</td><td>~10 paid sick days/year</td><td>3-month medical treatment period</td><td>Cannot terminate during medical leave</td></tr><tr><td>Singapore</td><td>Varies</td><td>~10 paid sick days/year</td><td>Prorated after 3 months service</td><td>Protected under Employment Act</td></tr></tbody></table>\n\n\n<h3>UAE: Your Contract Is All You've Got</h3>\n\n\n<p>This is the one that catches teachers off guard. Under UAE labor law, employees have no legal entitlement to sick leave during probation [1]. Zero days. After probation ends, the law provides 15 days at full pay, 30 at half pay, and 45 unpaid, totaling 90 days per year [2]. But during probation? The law is silent.</p>\n\n\n<p>That makes your contract the only thing protecting you. If the school offers 10 paid sick days and the contract applies them from your start date, you're covered, but only because the school chose to offer that. They didn't have to. And if a school in the UAE writes a contract that excludes sick pay during probation, they're within their legal rights. Most reputable schools won't do this, because they need to attract talent from a competitive international market. But smaller or newer operations might. Read the contract carefully.</p>\n\n\n<h3>Thailand: The Law Is Actually Generous</h3>\n\n\n<p>Thailand's Labour Protection Act provides 30 paid sick days per year from day one, regardless of probation status [3]. That's far more than the 10 days most school contracts specify. In practice, you'll use your contract's sick leave policy for routine absences and probably never think about the legal minimum. But if your school tries to penalize you for taking a sick day during probation, or claims you've \"used up\" your contractual allowance and docks your pay, the law provides a much higher ceiling.</p>\n\n\n<p>The 119-day probation standard in Thailand exists because after 120 days, employers must pay severance upon termination. So a school that fires you on day 118 avoids severance obligations. That's the real risk during probation in Thailand, not the sick days themselves, but whether the school uses a few absences as justification to end your contract before that 120-day mark.</p>\n\n\n<h3>China: Strongest Legal Protections</h3>\n\n\n<p>China's labor law includes a \"medical treatment period\" that applies regardless of probation status. For your first year of employment, you get three months of medical protection during which your employer cannot terminate your contract [4]. This is separate from your contractual 10 sick days. Your contract covers the routine stuff: a cold, food poisoning, a bad bout of flu. The medical treatment period kicks in for serious illness, and it means the school literally cannot fire you while you're within that protected window.</p>\n\n\n<p>Shanghai goes further, adding one month of protection for each additional year of service, up to 24 months total. I've known teachers in Beijing and Shanghai who got seriously ill during their first semester and were shocked to learn they had real, enforceable protections beyond what their contract spelled out. The key is getting proper documentation from a recognized hospital; a note from a neighborhood clinic sometimes isn't enough for HR to process.</p>\n\n\n<h3>Singapore: Structured and Clear</h3>\n\n\n<p>Singapore's Ministry of Manpower is explicit: probation should not affect your sick leave entitlement [5]. After three months of service, you're entitled to 14 days of outpatient sick leave and 60 days of hospitalization leave per year under the Employment Act. Before that three-month mark, it's technically up to your contract terms.</p>\n\n\n<p>Most international schools in Singapore offer benefits that exceed the legal minimum from day one, partly because the cost of living demands competitive packages and partly because schools like UWC South East Asia, Tanglin Trust, and SAS set a standard that others have to match. But the legal backstop is there if you need it.</p>\n\n\n<h2>What Schools Actually Do During Probation</h2>\n\n\n<p>Here's where my experience in administration becomes relevant. Most decent international schools aren't looking for reasons to fire sick teachers during probation. The recruitment cycle is expensive: posting on Search Associates or ISS costs money, flying candidates in for interviews costs money, processing work permits costs money. Replacing someone mid-year is a headache nobody wants. A teacher who takes three sick days in their first month isn't getting fired for it. That's just life in a new country.</p>\n\n\n<p>What I've seen more often is a subtler dynamic. A teacher takes a week off sick during probation, and when they return, they notice the principal observing their classes more frequently. The informal feedback gets a little more pointed. The mid-probation review mentions \"consistency\" and \"reliability\" in ways that feel loaded. The school isn't firing you for being sick. They're building a case for other concerns, and the absence just accelerated the timeline.</p>\n\n\n<p>The teachers who handle this well are the ones who over-communicate. They email the principal directly (not just the absence line), they provide medical certificates without being asked, and they make a visible effort when they return. It shouldn't have to work this way, but it does.</p>\n\n\n<h2>The Visa Problem Nobody Talks About</h2>\n\n\n<p>Getting terminated during probation isn't just a career setback. In most Asian countries, your work visa is sponsored by your employer. If the relationship ends, your legal right to remain in the country evaporates on a timeline that varies from \"immediately\" to \"30 days\" depending on jurisdiction.</p>\n\n\n<p>In the UAE, you typically get 30 days after termination to either find a new sponsor or leave [1]. In Thailand, it can be as little as seven days to report to immigration after your work permit is cancelled. China generally gives you 30 days but the process of transferring to a new employer's sponsorship is bureaucratically painful.</p>\n\n\n<p>This is why the \"just find another school\" advice sounds easier than it is. You're sick, you're stressed, your visa clock is ticking, and mid-year openings at good schools are rare. Some teachers end up taking whatever's available just to stay in-country, which is how people end up at the kind of schools that have vacancies mid-year for a reason.</p>\n\n\n<h2>What to Do Before You Sign</h2>\n\n\n<p>The best protection is knowing what to ask before you're in a position where it matters. Three questions:</p>\n\n\n<p>What is the sick leave policy during probation, and is it in writing? If the contract is vague, ask for the staff handbook section that covers this. Schools that can't produce a clear policy are waving a flag you should pay attention to. You're looking for explicit confirmation that your 10 (or however many) paid sick days apply from day one, not from the end of probation.</p>\n\n\n<p>Does the school provide health insurance from day one, or after probation? Some schools delay coverage until probation ends, which means your first three to six months are either uninsured or covered by whatever travel insurance you brought. That's a real gap when you're getting acclimated to tropical bacteria your immune system has never encountered.</p>\n\n\n<p>What happens to your visa if the contract ends during probation? The HR department should be able to walk you through this. If they can't, that tells you something about their experience with international hires.</p>\n\n\n<h2>If It Happens to You</h2>\n\n\n<p>Recover your original documents immediately. Your degree certificates, teaching license, background checks; whatever you submitted for the visa process. Some schools hold originals, and getting them back after a contentious separation is much harder than requesting them while you're still technically employed [6].</p>\n\n\n<p>Document everything. Save emails, take screenshots of messages, keep copies of your medical certificates. If your contractual rights aren't being honored and you end up needing to file a labor complaint (which is a real option in Thailand, China, and Singapore), documentation is everything. And know that the legal minimum may protect you even if your contract doesn't.</p>\n\n\n<p>Contact other schools before your visa expires. Search Associates has a \"currently available\" feature for exactly this situation. It's not ideal, but mid-year hires do happen, especially at schools that have just lost a teacher for the same reasons you might be looking.</p>\n\n\n<h2>References</h2>\n\n\n<p>[1] <a href=\"https://bshsoft.com/probation-period-in-the-uae-for-2025\" target=\"_blank\" rel=\"noopener noreferrer\">UAE Probation Period 2025: Rules, Laws & Employer Guide</a></p>\n\n\n<p>[2] <a href=\"https://www.timechart.org/blogs/sick-leave-uae-labour-law.html\" target=\"_blank\" rel=\"noopener noreferrer\">Medical & Sick Leave in UAE Labour Law: Guidelines & Requirements 2025</a></p>\n\n\n<p>[3] <a href=\"https://thailand.acclime.com/guides/employment-law/\" target=\"_blank\" rel=\"noopener noreferrer\">Understanding Labour & Employment Law in Thailand</a></p>\n\n\n<p>[4] <a href=\"https://english.shanghai.gov.cn/en-FAQS-WorkinShanghai/20251128/631fa651817a469b870c4a20f84887a4.html\" target=\"_blank\" rel=\"noopener noreferrer\">Sick Pay Rules and Medical Treatment Periods in Shanghai</a></p>\n\n\n<p>[5] <a href=\"https://www.mom.gov.sg/faq/sick-leave/probation-shouldnt-affect-your-sick-leave-entitlement\" target=\"_blank\" rel=\"noopener noreferrer\">Probation Should Not Affect Your Sick Leave Entitlement (Singapore MOM)</a></p>\n\n\n<p>[6] <a href=\"https://www.totallyteach.com/blog/what-should-i-do-if-i-dont-pass-probation-in-my-international-teaching-jobnbsp\" target=\"_blank\" rel=\"noopener noreferrer\">What Should I Do If I Don't Pass Probation in My International Teaching Job?</a></p>\n\n<hr>\n\n<strong>About This Article</strong>\n\n<p>Written by School Transparency, with AI assistance (Claude Sonnet 4.5). Research data sourced from World Bank API, International Schools Review, Reddit education communities, and Numbeo cost of living data.</p>\n\n<strong>Tech Stack:</strong> n8n workflow automation, Google Sheets data management, Anthropic's APIs for content generation, custom web scrapers for real-time data collection.\n\n<em>School Transparency is committed to data-driven insights for international teachers. All articles combine human expertise with AI tools to provide comprehensive, current information.</em>\n\n<hr>\n",
  "category": "Contracts & Salaries",
  "subcategory": "Benefits Packages",
  "publishedDate": "2026-02-11",
  "author": "School Transparency",
  "featuredImage": "https://images.unsplash.com/photo-1450101499163-c8848c66ca85?w=1200",
  "imageCredit": "Photo by <a href=\"https://unsplash.com/@homajob?utm_source=school_transparency&utm_medium=referral\">Scott Graham</a> on <a href=\"https://unsplash.com?utm_source=school_transparency&utm_medium=referral\">Unsplash</a>",
  "sources": [
    {
      "title": "UAE Probation Period 2025: Rules, Laws & Employer Guide",
      "url": "https://bshsoft.com/probation-period-in-the-uae-for-2025"
    },
    {
      "title": "Medical & Sick Leave in UAE Labour Law: Guidelines & Requirements 2025",
      "url": "https://www.timechart.org/blogs/sick-leave-uae-labour-law.html"
    },
    {
      "title": "Understanding Labour & Employment Law in Thailand",
      "url": "https://thailand.acclime.com/guides/employment-law/"
    },
    {
      "title": "Sick Pay Rules and Medical Treatment Periods in Shanghai",
      "url": "https://english.shanghai.gov.cn/en-FAQS-WorkinShanghai/20251128/631fa651817a469b870c4a20f84887a4.html"
    },
    {
      "title": "Probation Should Not Affect Your Sick Leave Entitlement (Singapore MOM)",
      "url": "https://www.mom.gov.sg/faq/sick-leave/probation-shouldnt-affect-your-sick-leave-entitlement"
    },
    {
      "title": "What Should I Do If I Don't Pass Probation in My International Teaching Job?",
      "url": "https://www.totallyteach.com/blog/what-should-i-do-if-i-dont-pass-probation-in-my-international-teaching-jobnbsp"
    }
  ],
  "relatedArticles": [
    "which-middle-east-countries-offer-the-best-retirement-benefits-for-long-term-expat-teachers",
    "what-red-flags-should-american-teachers-avoid-in-uae-private-school-contracts",
    "which-middle-east-countries-offer-best-teacher-compensation-packages-including-flight-allowances"
  ]
}