{
  "id": "what-happens-to-your-contract-if-your-school-closes-during-a-geopolitical-crisis",
  "title": "What Happens to Your Contract If Your International School Closes During a Geopolitical Crisis",
  "slug": "what-happens-to-your-contract-if-your-school-closes-during-a-geopolitical-crisis",
  "excerpt": "When international schools close due to geopolitical crises, your contract's force majeure clause determines if you'll still get paid. Most teachers don't realize this vague legal language can leave them financially stranded.",
  "content": "<h1>What Happens to Your Contract If Your International School Closes During a Geopolitical Crisis</h1>\n\n\n<p>It's 8 AM on a Tuesday. You're drinking coffee at your desk, grading papers before the first bell, when a message pops up in the staff WhatsApp group. \"Emergency leadership meeting today at 3 PM. Staff attendance mandatory.\" Three hours later, you learn that flights are being suspended, certain airspace is closed, and the school is \"temporarily moving to remote instruction, effective immediately.\"</p>\n\n\n<p>Then the real questions start. What does temporary mean? Are you still paid? If the school stays closed for weeks or months, what happens to your contract? Can they cut your salary if you're teaching online? Can you break your contract and leave without penalty?</p>\n\n\n<p>These aren't hypothetical anymore. In 2025, geopolitical instability in the Middle East and other regions has forced multiple international schools to close campuses, move to online learning, or in some cases, attempt to evacuate staff entirely [1]. Teachers caught in these situations discover that the contract language they didn't think twice about when signing is suddenly the only thing standing between them and a financial catastrophe.</p>\n\n\n<h2>What Force Majeure Actually Means (And What It Doesn't)</h2>\n\n\n<p>Almost every international school contract includes some version of a force majeure clause. The language usually reads something like: \"In the event of war, government action, natural disaster, or circumstances beyond the reasonable control of either party, the school may suspend its normal operations.\"</p>\n\n\n<p>Sounds straightforward. It isn't. The problem is what happens next, because the contract rarely specifies what \"suspend operations\" actually entails. Does it mean the school stops paying you? Does it mean you have to work for free while teaching remotely? Does it mean you can break your contract without penalty? The answer, almost universally, is: it depends on the exact wording of your contract, the country you're teaching in, and whether your school is financially stable [2].</p>\n\n\n<p>Force majeure is a legal concept that essentially says: when extraordinary circumstances make it impossible to fulfill a contract, neither party is liable for breach. Impossible is the key word. If schools can shift to online teaching, most lawyers would argue that the contract obligations continue; the delivery method just changes. If the government literally bans gatherings, or orders school buildings closed, that's clearer force majeure territory.</p>\n\n\n<p>But between those two extremes is a gray zone where schools and teachers disagree about what's required.</p>\n\n\n<h2>What Happens to Your Salary</h2>\n\n\n<p>This is the question that keeps teachers awake at night. If your school moves to remote instruction due to a geopolitical crisis, are you still paid your full salary?</p>\n\n\n<p>The answer, infuriatingly, is: probably yes, but check your contract. Some schools treat remote instruction as a continuation of normal teaching. Your classroom moved from a physical building to Zoom, but you're still doing your job, so you get your full salary. Other schools use the crisis as an opportunity to invoke cost-cutting provisions they buried in the contract. I've seen schools try to reduce salaries by 20-30% if they move online, claiming that \"benefits are reduced\" because teachers aren't using school facilities anymore.</p>\n\n\n<p>The strongest position you can be in is a contract that explicitly states: \"In the event of school closure or remote instruction, teachers receive their full salary including all benefits.\" Almost no contracts say this. What they actually say is something like: \"The school will make reasonable efforts to continue instruction and compensation,\" which is vague enough to give schools room to negotiate downward.</p>\n\n\n<p>If your school is solvent and didn't already plan for this scenario, you'll likely get paid in full. If the school was financially fragile to begin with, or if the closure is extended, that's when problems emerge. Teachers in schools that closed permanently during the 2020-2022 pandemic learned that their salaries stopped the moment the school shut down, regardless of what the contract said [3].</p>\n\n\n<h2>Can You Break Your Contract If the School Closes</h2>\n\n\n<p>Here's the hard truth: probably not, at least not without financial penalty. And the school can often invoke force majeure to excuse its own contract violations while holding you to yours.</p>\n\n\n<p>If your school closes and invokes a force majeure clause, that typically means the school is temporarily released from its obligation to provide in-person instruction. But most contracts don't give you the reciprocal right to break your contract just because the school is closed. You're often stuck in a holding pattern: the school isn't technically in breach (because they're covered by force majeure), but they're also not paying you as agreed (because they claim force majeure suspends their obligations too).</p>\n\n\n<p>The exceptions are when the school closure is indefinite or when the school explicitly terminates your contract due to financial difficulty. If the school formally ends your contract, you may be owed severance, though this varies enormously by country and contract terms. Some schools handle this correctly; others simply stop paying you and hope you eventually give up and leave [3].</p>\n\n\n<h2>What Happens With Housing, Flights, and Benefits</h2>\n\n\n<p>If your school provides accommodation, things get complicated. Many contracts state that housing is \"provided during the term of employment.\" If the school closes, is employment suspended or terminated? Does \"during employment\" mean the school has to keep paying rent on your apartment even if you're not physically there?</p>\n\n\n<p>Most schools take the position that if you can work remotely from anywhere, you no longer need school housing. They'll stop paying your rent or ask you to vacate. Some give you a grace period (30-90 days); others want you out immediately. If you signed a housing clause that doesn't explicitly address this scenario, you're in a weak negotiating position [2].</p>\n\n\n<p>Return flights are another gray area. Many contracts promise to cover flights home at the end of your contract term. If your school closes mid-year and invokes force majeure, do they still owe you a flight? Most schools will argue they don't, claiming that force majeure exempts them from expensive obligations. Again, this depends on how the contract is worded.</p>\n\n\n<p>Health insurance is usually suspended on the same day the school closes, which is particularly grim if you're in a country with expensive private healthcare and you're suddenly uninsured.</p>\n\n\n<h2>The Real Stuff No One Talks About: What Happens to Online Teaching</h2>\n\n\n<p>If your school moves to remote instruction, you're teaching. You're doing the job. But the logistics suddenly become your problem instead of the school's.</p>\n\n\n<p>You need reliable internet. The school won't pay for an upgrade. You need a quiet workspace. If you're in a small apartment shared with three roommates, that might not exist. You need to suddenly shift your entire teaching practice to an online platform, probably with minimal training. And you're expected to do it all while possibly dealing with the stress, fear, or reality of a geopolitical crisis happening around you.</p>\n\n\n<p>Many international schools' contracts don't address teaching conditions or equipment at all. They assume you'll be teaching in a school building. When you shift to remote, you're expected to figure it out. Some schools do provide support; most don't. Your contract obligation to teach doesn't change, but the practical ability to do it well gets much harder.</p>\n\n\n<h2>What to Check in Your Contract Right Now</h2>\n\n\n<p>If you're teaching internationally, or considering a position abroad, look for these specific clauses:</p>\n\n\n<strong>Force majeure definition.</strong> Does it spell out exactly what circumstances trigger it? \"War, government action, natural disaster\" is vague. Does a single missile strike count? A government advisory warning against travel? The more specifically defined, the better. Vagueness tends to favor the school.\n\n\n<strong>Compensation during force majeure.</strong> What's your salary situation if the school closes? Is it explicitly guaranteed, or does it say \"school will make reasonable efforts\"? Get a guarantee in writing.\n\n\n<strong>Remote instruction terms.</strong> If schools must close but can teach online, what are your obligations? Can you be required to teach without preparation time? Can your salary be reduced for teaching online? This should be spelled out.\n\n\n<strong>Repatriation flights.</strong> If the school closes and you need to leave, does the school cover your flight? Is it immediate, or do you have to wait for a \"normal\" termination? Get this in writing.\n\n\n<strong>Severance if the school closes.</strong> What do you get if the school permanently closes or is unable to pay you? Some schools include severance terms tied to force majeure; most don't.\n\n\n<h2>What To Do If It's Happening Now</h2>\n\n\n<p>If your school has closed or is about to, do this:</p>\n\n\n<strong>Document everything.</strong> Save all communications from the school about the closure, salary status, housing, and return. Emails, WhatsApp, everything. You'll need proof of what the school promised.\n\n\n<strong>Get written confirmation.</strong> Don't rely on hallway conversations or staff meetings. Ask for written confirmation of: your salary status, your housing situation, your expected return date (if applicable), and your repatriation flight (if promised).\n\n\n<strong>Know your country's labor laws.</strong> If you're teaching in a country with strong labor protections, the school can't simply zero your salary or evict you from housing because of force majeure. If you're in a country with weaker protections, the school has more power. Contact a local employment lawyer if the closure is likely to be extended.\n\n\n<strong>Reach out to your embassy.</strong> If you're a citizen of a country with a diplomatic presence, register with your embassy. They can provide information about evacuation routes, repatriation flights, and emergency loans if the school doesn't pay you.\n\n\n<strong>Talk to other teachers.</strong> You're not the only one in this situation. Other teachers at your school may have already negotiated solutions. Some schools negotiate with teachers collectively, which gives you more leverage [2].\n\n\n<h2>The Uncomfortable Reality</h2>\n\n\n<p>International school contracts are written to favor schools in normal times. When a crisis hits, they're often barely tested, and many schools interpret force majeure clauses in whatever way minimizes their costs. The teachers who fare best are the ones who had strong contracts to begin with and the ones who negotiate immediately when the crisis hits, before the school's financial situation becomes dire.</p>\n\n\n<p>If you're currently in a vulnerable situation because of a school closure, contact your home country's embassy and seek legal advice in your host country. If you're signing a contract with an international school anywhere in a geopolitically unstable region, push for explicit language around force majeure. The school would push back if the tables were turned. You should too.</p>\n\n\n<h2>References</h2>\n\n\n<p>[1] <a href=\"https://www.tes.com/magazine/analysis/specialist-sector/geopolitics-ai-pressures-shaping-international-schools\" target=\"_blank\" rel=\"noopener noreferrer\">From geopolitics to AI, the pressures shaping international schools</a></p>\n\n\n<p>[2] <a href=\"https://www.teachaway.com/blog/understanding-international-teaching-contracts\" target=\"_blank\" rel=\"noopener noreferrer\">Understanding International Teaching Contracts</a></p>\n\n\n<p>[3] <a href=\"https://teachertaskforce.org/blog/how-covid-19-pandemic-affecting-contract-teachers-sub-saharan-africa\" target=\"_blank\" rel=\"noopener noreferrer\">How the COVID-19 pandemic is affecting contract teachers in sub-Saharan Africa</a></p>\n\n\n<p>[4] <a href=\"https://www.clements.com/resources/employee-protection/risk-management-international-schools-protecting-students-staff/\" target=\"_blank\" rel=\"noopener noreferrer\">Risk Management for International Schools: Protecting Students & Staff</a></p>\n\n\n<p>[5] <a href=\"https://inee.org/resources/protecting-education-insecurity-and-armed-conflict-international-law-handbook\" target=\"_blank\" rel=\"noopener noreferrer\">Protecting Education in Insecurity and Armed Conflict: An International Law Handbook</a></p>\n\n\n<p>[6] <a href=\"https://plan-international.org/middle-east-e-s-africa/blog/2025/11/09/why-protecting-education-in-conflict-is-global-imperative/\" target=\"_blank\" rel=\"noopener noreferrer\">Why protecting education in conflict is a global imperative</a></p>\n\n<hr>\n\n<strong>About This Article</strong>\n\n<p>Written by School Transparency, with AI assistance (Claude Sonnet 4.5). Research data sourced from World Bank API, International Schools Review, Reddit education communities, and Numbeo cost of living data.</p>\n\n<strong>Tech Stack:</strong> n8n workflow automation, Google Sheets data management, Anthropic's APIs for content generation, custom web scrapers for real-time data collection.\n\n<em>School Transparency is committed to data-driven insights for international teachers. All articles combine human expertise with AI tools to provide comprehensive, current information.</em>\n\n<hr>\n",
  "category": "Contracts & Salaries",
  "subcategory": "Contract Negotiation",
  "publishedDate": "2026-03-01",
  "author": "School Transparency",
  "featuredImage": "https://images.unsplash.com/photo-1450101499163-c8848c66ca85?w=1200",
  "imageCredit": "Photo by <a href=\"https://unsplash.com/@homajob?utm_source=school_transparency&utm_medium=referral\">Scott Graham</a> on <a href=\"https://unsplash.com?utm_source=school_transparency&utm_medium=referral\">Unsplash</a>",
  "sources": [
    {
      "title": "From geopolitics to AI, the pressures shaping international schools",
      "url": "https://www.tes.com/magazine/analysis/specialist-sector/geopolitics-ai-pressures-shaping-international-schools"
    },
    {
      "title": "Understanding International Teaching Contracts",
      "url": "https://www.teachaway.com/blog/understanding-international-teaching-contracts"
    },
    {
      "title": "How the COVID-19 pandemic is affecting contract teachers in sub-Saharan Africa",
      "url": "https://teachertaskforce.org/blog/how-covid-19-pandemic-affecting-contract-teachers-sub-saharan-africa"
    },
    {
      "title": "Risk Management for International Schools: Protecting Students & Staff",
      "url": "https://www.clements.com/resources/employee-protection/risk-management-international-schools-protecting-students-staff/"
    },
    {
      "title": "Protecting Education in Insecurity and Armed Conflict: An International Law Handbook",
      "url": "https://inee.org/resources/protecting-education-insecurity-and-armed-conflict-international-law-handbook"
    },
    {
      "title": "Why protecting education in conflict is a global imperative",
      "url": "https://plan-international.org/middle-east-e-s-africa/blog/2025/11/09/why-protecting-education-in-conflict-is-global-imperative/"
    }
  ],
  "relatedArticles": [
    "what-happens-if-my-international-school-doesn-t-renew-my-contract-during-probationary-period",
    "how-does-jamaica-s-economic-growth-impact-international-school-teacher-benefits",
    "what-happens-if-i-get-sick-during-probation-period-at-international-schools-in-asia"
  ]
}