{
  "id": "your-school-says-it-covers-emergency-repatriation-read-your-policy",
  "title": "Your School Says It Covers Emergency Repatriation. Read Your Policy.",
  "slug": "your-school-says-it-covers-emergency-repatriation-read-your-policy",
  "excerpt": "Most international school contracts cover repatriation of remains, not emergency medical evacuation while you're alive. Medical evacuation costs $40,000 to $100,000, and you'll need separate insurance to avoid paying out of pocket.",
  "content": "<h1>Your School Says It Covers Emergency Repatriation. Read Your Policy.</h1>\n\n\n<p>Your contract mentions \"emergency repatriation.\" You assume that means your school will pay to fly you home if something catastrophic happens. Read the fine print. It probably doesn't.</p>\n\n\n<p>This is one of the most common misunderstandings in international teaching contracts. Schools list repatriation as a benefit. Teachers assume it's included. Then an actual emergency happens, and the teacher discovers the contract only covers repatriation of remains (your body), not emergency medical evacuation (you alive, needing treatment). Most international schools do not include medical evacuation and repatriation in their standard health insurance. You have to buy it separately [1].</p>\n\n\n<h2>What Emergency Repatriation Actually Means</h2>\n\n\n<p>Repatriation has two distinct meanings. Teachers confuse them constantly.</p>\n\n\n<strong>Repatriation of Remains:</strong> If you die abroad, your body is returned to your home country. Cost covered by the school (sometimes). Frequency: rare.\n\n\n<strong>Emergency Medical Evacuation:</strong> You're seriously ill or injured. The local hospital can't treat you. You need transport to a medical centre of excellence, usually in a developed country. Then, after stabilization or treatment, transport back home. Cost: potentially $40,000 to $100,000 USD. Frequency: rare but not impossible [2].\n\n\n<p>Your contract probably covers the first. You need insurance for the second.</p>\n\n\n<h2>Why This Matters: Real Costs</h2>\n\n\n<p>Medical evacuation isn't cheap. A teacher in a remote location with a serious illness (dengue fever, appendicitis, car accident requiring specialized surgery) might need air ambulance transport. Air ambulance from Southeast Asia to Singapore or Bangkok: $15,000 to $40,000. From the Middle East to London: $30,000 to $80,000. Then hospital costs. Then return home [3].</p>\n\n\n<p>No teacher has this cash lying around. Your school isn't paying it unless your contract explicitly says so. Most don't.</p>\n\n\n<h2>What International Schools Actually Provide</h2>\n\n\n<p>Research shows variation:</p>\n\n\n<strong>J-1 Exchange Program Teachers</strong> (US-based):\n<p>All participants are automatically enrolled in emergency evacuation and repatriation plans. Coverage example: $100,000 medical benefits, $25,000 repatriation of remains, $50,000 emergency evacuation, $500 deductible [2].</p>\n\n\n<strong>Standard International School Contracts:</strong>\n<p>One school's benefits package lists: housing, travel, relocation, shipping, international medical insurance, life and disability insurance, retirement allowance, and tuition waiver for children. No specific mention of emergency medical evacuation [2].</p>\n\n\n<strong>The Reality:</strong>\n<p>Most schools provide basic health insurance (doctor visits, hospital stays in-country). They do not provide medical evacuation to another country. If the local hospital can't treat you, you're on your own financially [1].</p>\n\n\n<h2>What You Actually Need: The Coverage Limits</h2>\n\n\n<p>If you're going to buy separate coverage (which you should), understand what you're looking for:</p>\n\n\n<strong>Minimum Coverage Amounts:</strong>\n<p>- Emergency medical evacuation: $50,000 USD</p>\n<p>- Repatriation of remains: $25,000 USD</p>\n<p>- Return of dependent children: covered</p>\n<p>- Emergency reunion (family member travel): covered</p>\n<p>- 24/7 assistance services: required [2]</p>\n\n\n<strong>Real Insurance Options:</strong>\n\n\n<p>TieCare International is the largest provider for international school teachers. Plans range $300 to $600 USD annually depending on age, destination, and coverage level. Multiple plan options available [1].</p>\n\n\n<p>Cigna Global offers three tiers: Silver (capped benefit, affordable), Gold ($2 million coverage per person), and Platinum (unlimited coverage). More expensive than TieCare but comprehensive [2].</p>\n\n\n<p>Atlas MedEvac offers budget options: $43 for 3 months, 18 cents per day. Covers medical evacuation and repatriation [3].</p>\n\n\n<p>Additional providers: IMG (IMG Global), Allianz Care International, Seven Corners. All offer evacuation and repatriation coverage starting around $300-400 annually [2].</p>\n\n\n<h2>How to Verify Your Coverage (Right Now)</h2>\n\n\n<p>Your contract says \"health insurance provided.\" That's not enough. You need to ask:</p>\n\n\n<strong>1. Does your school's insurance include emergency medical evacuation?</strong>\n<p>Answer: Usually no. Ask for confirmation in writing.</p>\n\n\n<strong>2. If not, will the school pay for supplemental evacuation insurance?</strong>\n<p>Answer: Sometimes. Some schools buy it as an add-on. Some make teachers purchase it themselves.</p>\n\n\n<strong>3. What are the actual coverage limits?</strong>\n<p>Answer: Get the policy document. Look for evacuation coverage amount and repatriation coverage amount. If they're missing or vague, you don't have it.</p>\n\n\n<strong>4. What's the deductible?</strong>\n<p>Answer: $500 is standard. Some plans have none. Affects your out-of-pocket cost if evacuation is needed.</p>\n\n\n<h2>The Most Dangerous Situation</h2>\n\n\n<p>You're teaching in a developing country. Your school provides health insurance. You assume that covers evacuation. A serious illness or accident happens. The local hospital is competent but limited (no specialist, no advanced equipment). You need evacuation to Thailand, Singapore, or Manila for treatment. You ask your school to cover it. They say it's not in their health insurance plan. You now owe $40,000 out of pocket, or your family does [1].</p>\n\n\n<p>This has happened. Multiple times. Not to many people, but to enough that it's a real risk.</p>\n\n\n<h2>What to Do Before Accepting a Contract</h2>\n\n\n<p>1. Get the actual health insurance policy document from your school. Not a summary. The actual policy.</p>\n<p>2. Search it for the words \"evacuation,\" \"repatriation,\" \"air ambulance,\" \"medical transport.\"</p>\n<p>3. If those words don't appear, you don't have that coverage.</p>\n<p>4. Ask your school: \"If I need emergency medical evacuation, who pays?\"</p>\n<p>5. If the answer is vague, ask for it in writing.</p>\n<p>6. If your school won't cover it, price out supplemental evacuation insurance ($300-400/year is reasonable). Factor that into your decision [1][2].</p>\n\n\n<h2>If Your School Doesn't Cover It</h2>\n\n\n<p>You can buy standalone evacuation insurance. Cost is low: $300-600 annually for comprehensive coverage. Plans are easy to purchase before you leave for your position. Do it. The chance you need it is low. The cost if you do need it and don't have coverage is catastrophic [3].</p>\n\n\n<p>One more thing: if your school is in a developing country with limited medical infrastructure (parts of Africa, Southeast Asia, South Asia, Central America), evacuation insurance is not optional. It's essential. Even if your school says they cover it, verify the actual policy before you leave [1].</p>\n\n\n<h2>References</h2>\n\n\n<p>[1] <a href=\"https://apostille-usa.com/2023/12/insurance-faqs-for-teachers-planning-to-work-abroad/\" target=\"_blank\" rel=\"noopener noreferrer\">Insurance FAQs for Teachers Working Abroad: Coverage & Tips</a></p>\n\n\n<p>[2] <a href=\"https://www.depts.ttu.edu/international/isss/scholarstaff/j1exchange/j1exchins.php\" target=\"_blank\" rel=\"noopener noreferrer\">Medical, Repatriation & Evacuation Insurance Requirements for International Faculty and Scholars</a></p>\n\n\n<p>[3] <a href=\"https://www.internationalstudentinsurance.com/blog/2015/10/medical-evacuation-and-repatriation-why-it-matters.html\" target=\"_blank\" rel=\"noopener noreferrer\">Medical Evacuation and Repatriation Insurance Explained</a></p>\n\n\n<p>[4] <a href=\"https://www.pacificprime.com/insurers-and-partners/tiecare-international/\" target=\"_blank\" rel=\"noopener noreferrer\">TieCare International: Group Insurance for Educators</a></p>\n\n\n<p>[5] <a href=\"https://www.cignaglobal.com/international-health-plans\" target=\"_blank\" rel=\"noopener noreferrer\">Cigna Global International Health Plans</a></p>\n\n\n<p>[6] <a href=\"https://trawickinternational.com/products/international-student-and-scholar-medical-evacuation-and-repatriation/\" target=\"_blank\" rel=\"noopener noreferrer\">Trawick International Medical Evacuation and Repatriation</a></p>\n\n<hr>\n\n<strong>About This Article</strong>\n\n<p>Written by School Transparency, with AI assistance (Claude Sonnet 4.5). Research data sourced from World Bank API, International Schools Review, Reddit education communities, and Numbeo cost of living data.</p>\n\n<strong>Tech Stack:</strong> n8n workflow automation, Google Sheets data management, Anthropic's APIs for content generation, custom web scrapers for real-time data collection.\n\n<em>School Transparency is committed to data-driven insights for international teachers. All articles combine human expertise with AI tools to provide comprehensive, current information.</em>\n\n<hr>\n",
  "category": "Contracts & Salaries",
  "subcategory": "Benefits Packages",
  "publishedDate": "2026-03-02",
  "author": "School Transparency",
  "featuredImage": "https://images.unsplash.com/photo-1532883130016-f3d311140ba8?crop=entropy&cs=tinysrgb&fit=max&fm=jpg&ixid=M3w4NDM5OTl8MHwxfHNlYXJjaHwxfHxTY2hvb2wlMjBTYXlzJTIwQ292ZXJzJTIwRW1lcmdlbmN5fGVufDB8fHx8MTc3MjQyOTg3Nnww&ixlib=rb-4.1.0&q=80&w=1080",
  "imageCredit": "Photo by <a href=\"https://unsplash.com/@ninjason?utm_source=school_transparency&utm_medium=referral\">Jason Leung</a> on <a href=\"https://unsplash.com?utm_source=school_transparency&utm_medium=referral\">Unsplash</a>",
  "sources": [
    {
      "title": "Insurance FAQs for Teachers Working Abroad: Coverage & Tips",
      "url": "https://apostille-usa.com/2023/12/insurance-faqs-for-teachers-planning-to-work-abroad/"
    },
    {
      "title": "Medical, Repatriation & Evacuation Insurance Requirements for International Faculty and Scholars",
      "url": "https://www.depts.ttu.edu/international/isss/scholarstaff/j1exchange/j1exchins.php"
    },
    {
      "title": "Medical Evacuation and Repatriation Insurance Explained",
      "url": "https://www.internationalstudentinsurance.com/blog/2015/10/medical-evacuation-and-repatriation-why-it-matters.html"
    },
    {
      "title": "TieCare International: Group Insurance for Educators",
      "url": "https://www.pacificprime.com/insurers-and-partners/tiecare-international/"
    },
    {
      "title": "Cigna Global International Health Plans",
      "url": "https://www.cignaglobal.com/international-health-plans"
    },
    {
      "title": "Trawick International Medical Evacuation and Repatriation",
      "url": "https://trawickinternational.com/products/international-student-and-scholar-medical-evacuation-and-repatriation/"
    }
  ],
  "relatedArticles": [
    "what-happens-to-your-contract-if-your-school-closes-during-a-crisis",
    "what-happens-to-your-contract-if-your-school-closes-during-a-geopolitical-crisis",
    "what-happens-if-my-international-school-doesn-t-renew-my-contract-during-probationary-period"
  ]
}